["oto credit: Dr. Bob Remedi\nii  Return to Table of Contents  Principles of Biology – An Introduction to Biological Concepts has been modified from several OpenStax textbooks \nincluding  Concepts of Biology, Biology 2E, Microbiology and Anatomy and Physiology . These textbooks have been cited \nand attributed below. Each textbook can be accessed  for free in its original form by clicking on the links  included with \neach book citation . The OpenStax textbooks are licensed under  Creative Commons Attribution License 4.0. Concepts of Biology OpenStax  \no Authors: Samantha Fowler, Rebecca Roush, James Wise  \no Publisher/website: OpenStax  \no Book title: Concepts of Biology  \no Publication date: Apr 25, 2013  \no Location: Houston, Texas  \no Book URL:  https://openstax.org/books/c oncepts-biology/pages/1 -introduction  \no Section URL:  https://openstax.org/books/concepts -biology/pages/1 -introduction  \n© Jan 12, 2021 OpenStax.", "Textbook content produced by Ope nStax is licensed under a Creative Commons Attribution License 4.0 \nlicense. The OpenStax name, OpenStax logo, OpenStax book covers, OpenStax CNX name, and OpenStax CNX logo are not \nsubject to the Creative Commons license and may not be reproduced without t he prior and express written consent of Rice \nUniversity. Biology 2E OpenStax  \no Authors: Mary Ann Clark, Matthew Douglas, Jung Choi  \no Publisher/website: OpenStax  \no Book title: Biology 2e  \no Publication date: Mar 28, 2018  \no Location: Houston, Texas  \no Book URL: https://openstax.org/books/biology -2e/pages/1 -introduction  \no Section URL: https://openstax.org/books/bio logy-2e/pages/1 -introduction  \n© Jan 7, 2021 OpenStax. Textbook content produced by OpenStax is licensed under a Creative Commons Attribution License 4.0 \nlicense.", "The OpenStax name, OpenStax logo, OpenStax book covers, OpenStax CNX name, and OpenStax CNX log o are not \nsubject to the Creative Commons license and may not be reproduced without the prior and express written consent of Rice \nUniversity.", "Microbiology OpenStax  \no Authors: Nina Parker, Mark Schneegurt, Anh -Hue Thi Tu, Philip Lister, Brian M. Forster \no Publisher/website: OpenStax  \no Book title: Microbiology  \no Publication date: Nov 1, 2016  \no Location: Houston, Texas  \no Book URL:  https://openstax.org/books/microbiology/pages/1 -introduction  \no Section URL:  https://openstax.org/books/microbiology/pages/1 -introduction  \n© Aug 20, 2020 OpenStax. Textbook content produced by OpenStax is licensed under a Creative  Commons Attribution License 4.0 \nlicense. The OpenStax name, OpenStax logo, OpenStax book covers, OpenStax CNX name, and OpenStax CNX logo are not \nsubject to the Creative Commons license and may not be reproduced without the prior and express written conse nt of Rice \nUniversity. Anatomy and Physiology OpenStax  \no Authors: J. Gordon Betts, Kelly A. Young, James A. Wise, Eddie Johnson, Brandon Poe, Dean H. Kruse, Oksana \nKorol, Jody E.", "Johnson, Mark Womble, Peter DeSaix  \no Publisher/website: OpenStax  \no Book title: Anatomy and Physiology  \no Publication date: Apr 25, 2013  \no Location: Houston, Texas  \no Book URL: https://openstax.org/books/anatomy -and-physiology/pages/1 -introduction  \no Section URL:  https://openstax.org/books/anatomy -and-physiology/pages/1 -introduction  \n© Sep 11, 2020 OpenStax. Textbook content produced by OpenStax is licensed under a Creative Commons Attribution License 4.0 \nlicense. The OpenStax name, OpenStax logo, OpenStax book covers, OpenStax CNX name, and OpenStax CNX logo are not \nsubject to the Cre ative Commons license and may not be reproduced without the prior and express written consent of Rice \nUniversity.", "Unit 1.", "The Cellular Foundation of Life  \nChapter 1: Introduction to Biology  and the Process of Science  (pages 1-24) \no 1.1 Themes and Concepts of Biology  (page 1) \no 1.2 The Process of Science  (pages 14) \nChapter 2: Introduction to the Chemistry of Life  (pages 25-61) \no 2.1 The Building Blocks of Molecules  (page 25) \no 2.2 Chemical Bonds  (page 38) \no 2.3 Water  (page 48) \no 2.4 pH and Buffers  (page 56) \nChapter 3 Biological ly Important  Molecules  (pages 63-101) \no 3.1 Carbon  (page 64) \no 3.2 Synthesis and Breakdown of Macromolecules  (page 68) \no 3.3 Biological Molecules – Carbohydrates  (page 72) \no 3.4 Biological Molecule s – Lipids (page 79) \no 3.5 Biological Molecules – Proteins (page 87) \no 3.6 Biological Molecules - Nucleic Acids  (page 97) \nChapter 4: Introduction to Cell Structure and Function  (pages 10 3-144) \no 4.1 How Microorganisms Are Studied  (page 104) \no 4.2 Comparing Prokaryotic and Eukaryotic Cells  (page 108) \no 4.3 Eukaryotic Cell Components  (page 113) \no 4.4 Eukaryotic Cell Organelles  (page 120)  \no 4.5 Diversity of cell organelles within the eukaryotes  (page 133)", "iv  Return to Table of Contents  Chapter 5: Structure and Function of the Cell Membrane and an Introduction to \nEnergy (pages 145-191) \no 5.1 The Cell Membrane (page  145) \no 5.2 Passive Transport (page  152) \no 5.3 Active Transport (page  161) \no 5.4 Energy and Metabolism  (page 166) \no 5.5 Law of Thermodynamics  (page 171) \no 5.6 Types of Energy  (page 175) \no 5.7 Enzymes (page 184) \nChapter 6: Introduction to Cellular Respiration  (pages 193-222) \no 6.1 Energy in Living Systems  (page 193) \no 6.2 Glycolysis  (page 201) \no 6.3 Citric Acid Cycle  (page 206) \no 6.4 Oxidative phosphorylation  (page 210) \no 6.5 Fermentation  (page 216) \no 6.6 Connections to Other Metabolic Pathways  (page 220) \nChapter 7: Introduction to Photosynthesis  (pages 223-246) \no 7.1: Overview of Photosynthesis  (page 223) \no 7.2: The Light -Dependent Reactions of Photosynthesis  (page 232) \no 7.3: The Calvin Cycle  (page 240)", "Access for free at https://openstax.org/   v Unit 2: Cell Division and Genetics  \nChapter 8: Introduction to Reproduction at the Cellular Level  (pages 247-293) \no 8.1 The Genome  (page 248) \no 8.2 The Cell Cycle and Mitosis  (page 252) \no 8.3 Prokaryotic Cell Division  (page 265) \no 8.4 Sexual Reproduction  (page 269) \no 8.5 Meiosis  (page 272) \no 8.6 Errors in Meiosis  (page 287) \nChapter 9: Introduction to Patterns of Inheritance  (pages 295-333) \no 9.1 Gregor Mendel and Genetic Crosses  (page 295) \no 9.2 Laws of Inheritance  (page 301) \no 9.3 Extensions of the Laws of Inheritance  (page 313) \no 9.4 Chromosomal Basis of Inheritance  (page 320) \no 9.5 Patterns of  Inheritance  (page 326) \nUnit 3: Molecular Biology and Biotechnology  \nChapter 10: DNA Replication and Protein Synthesis  (pages 335-376) \no 10.1 The Structure of DNA  (page 335) \no 10.2 DNA Replication  (page 343) \no 10.3 Transcription  (page 355) \no 10.4 Translation  (page 364) \no 10.5 How Genes A re Regulated  (pages 372) \nUnit 4: Evolution and Introduction to Biotechnology  \nChapter 11: Introduction Evolution  (pages 379-405) \no 11.1 Discovering How Populations Change  (page 378) \no 11.2 Mechanisms of Evolution (page  388) \no 11.3.", "About Our Team  \nPrinciples of Biology – An Introduction to Biological Concepts would not be possible without \nthe work of the following College of Lake County faculty contributing aut hors and review ers. \nSenior Faculty Contributing Author and Reviewer  \nElizabeth O’Grady , PhD \nFaculty Contributing Authors and Reviewers  \nJason Cashmore , MS \nMarsha Hay , MS \nCarol Wismer , MS", "This textbook  was put together to increase accessibility  and provide a quality textbook at little or \nno cost to student learners. This work was funded in part by  a sabbatical  provided by the College \nof Lake County and support by the Biological and Health Science Division . A special thank you \nto Mark Coykendall, Biology Department Chair, for his support and encouragement .", "All written text found in Principles of Biology – An Introduction to Biological Concepts a nd the \nOpenStax textbooks are licensed under  Creative Commons Attribution License 4.0.  The images , \nphotos, graphs, etc.  used in this textbook have each been individually attributed . Images, photos, \ngraphs, etc.  have different creative commons licenses  and have been licensed according to their \noriginal authors. An attribution table can be located on  the last pages of this textbook.", "Figure 1.1 This NASA image is a composite of several satellite -based views of Earth. (credit: \nmodification of work by NASA/Concepts of Biology OpenStax ) \nViewed from space, Earth offers very few clues about the diversity of life forms that can be \nfound there. The first forms of life on Earth are thought to have been microorganisms that \nexisted for billions of years before plants and animals appeared. Mammals, b irds, and flowers are \nall relatively recent additions to the planet, originating 130 to 200 million years ago. Humans \nhave only inhabited this planet for the last 2.5 million years, and only in the last 200,000 years \nhave humans started looking like we do today. \n1.1 Themes and Concepts of Biology", "Biology is the science that studies life. What exactly is life? This may sound like a silly question \nwith an obvious answer; however, it is not always easy to define life. For example, a branch of \nbiology called virology studies viruses. Viruses exhibit some of t he characteristics of life but \nlack others. It turns out that although viruses can attack living organisms, cause diseases, and \neven reproduce with the help of host cells, they do not meet all the criteria that biologists use to \ndefine life.  \nFrom its earli est beginnings, biology has wrestled with four questions: What are the shared \nproperties that make something “alive”? How do those various living things function? Planet", "2  Return to Table of Contents  earth has a diversity of life forms; how do we organize and classify these different o rganisms? Finally, how did this diversity arise, and how is it continuing? As new organisms are discovered \nevery day, biologists continue to seek answers to these and other questions. Properties of Life  \nAll living organisms share the following key characte ristics: order, response to stimuli, \nreproduction, adaptation, growth and development, homeostasis, and energy processing. These \nseven characteristics serve to define life. It is essential that students know these different \nproperties of life and be able t o explain each. Order \nOrganisms are highly organized and consist of one or more cells. Even very simple, single -celled \norganisms are remarkably complex. Inside each cell, atoms come together through chemical \nbonding and form molecules. Molecules come toge ther to form cell components or structures \ncalled organelles.", "Like the toad shown in Figure 1.2, \nmulticellular organisms can consist of millions of \ncells. Different groups of cells then specialize in \nperforming specific functions. Without order, \nspecialization would not be possible. Figure 1.2 A toad represents a highly organized  \nindividual. (credit: \"Ivengo(RUS)\" /Wikimedia \nCommons )", "Response to Stimuli  \nOrganisms respond to diverse stimuli. For example, plants can bend toward a source of light or \nrespond to touch (Figure 1.3). Even tiny bacte ria can move toward or away from chemicals, a \nprocess called chemotaxis. A movement toward a stimulus is considered a positive response, \nwhile movement away from a stimulus is regarded as a negative response.  \nHumans also respond to stimuli. For example, when we become warm on a hot sunny day, the \nbody has tiny glands called sudoriferous, or sweat, \nglands that make and release sweat onto the skin's \nsurface. The heat from the body can be transferred to \nthe sweat, which acts as a cooling mechanism a nd \nhelps to maintain constant body temperature.  \nFigure 1.3 The leaves of this sensitive plant ( Mimosa \npudica) will instantly droop and fold when touched. \nAfter a few minutes, the plant returns to its normal \nstate. (credit: Alex Lomas /Concepts of Biology \nOpenStax )", "Access for free at https://openstax.org/   3 CONCEPTS IN ACTION - Watch this video to see how the sensitive plant responds to a touch \nstimulus.  \nReproduction  \nReproduction is necessary on both a cellular and organismal level. For a population to survive, \nsome individuals with in that population must reproduce. Organisms that are multicellular, such \nas plants and animals, also need to reproduce on a cellular level. As old cells become damaged or \nworn out, they must be replaced by new cells. For example, \nskin cells are damaged co ntinuously and need to be replaced \nevery two to three weeks; otherwise, the skin would lose its \nability to provide protection.  \nSingle-celled organisms must also reproduce. Reproduction \nbegins by first duplicating their genetic material. Once the \ngenetic ma terial is duplicated, it is then divided equally into \ntwo new cells (Figure 1.4). The two new daughter cells should \nbe identical to the parent cell.", "Adaptation  \nAll living organisms exhibit a “fit” to their environment. Biologists refer to this fit as \nadaptation. Adaptations are a consequence of evo lution by natural selection. Evolution has had \nsome impact on every lineage of reproducing organisms. Examples of adaptations are diverse \nand unique. For example, some microorganisms live in boiling hot springs, whereas some moths \nhave tongues the exact le ngth of the flower from which they feed. Adaptations are vital because they enhance an individual's ability to survive and reproduce; \nhowever, adaptations are not constant. As an environment changes, natural selection causes the \nindividuals in a population  to adapt to those changes. For example, imagine that there is a population of finches living on an island. An environmental \nevent has resulted in two main food sources : soft insects and hard seeds. Not all finches within \nthe population have the same beak length or size.", "Finches in the population that have long, \nskinny beaks begin to feed on soft insects because they are easy for those birds to catch and eat . Finches with large, more dense beaks feed on hard seeds because their dense beaks allow them to", "4  Return to Table of Contents  crush and open the hard seeds. Unfortunately, finches that have beaks that are neither long nor \ndense may slowly begin to decline in number because they are limited in their ability to obtain \nnutrients. Finches that obtain food can put energy into reproduction and survival needs. When \nthose finches reproduce, they pass along those adaptations that a llow them to be successful in \ntheir respective feeding environments. Over time two distinct groups may arise, those with thick, \ndense beaks and those with longer skinnier beaks (Figure 1.5). If these individuals genetically \nchange in such a way that they n o longer can interbreed with one another, a speciation event will \nhave occurred.", "Figure 1.5 Different finch phenotype variations \ndue to environmental changes. (credit: National Human Genome Research \nInstitute's Talking Glossary /Wikimedia \nCommons ) \nGrowth and Development  \nDevelopment is often described as the processes that an individual goes through as it grows and \nmatures. For example, i n humans, development begins once the sperm fertilizes the egg. Human \ndevelopment can be broken down into different stages including embryonic development, fetal \ndevelopment, infancy, childhood, puberty, and adulthood. Development can also be observed in \nmany other organisms. For example, b utterflies go through a developmental process called \nmetamorphosis  that begins at the egg stage and  then proceeds to the larva, pupa, and adult stages. Both multicellular and single -celled organisms grow and develop acc ording to specific \ninstructions encoded in their DNA. DNA is organized into genes that provide information for \ncellular growth and development.", "Figure 1.6 Although no two looks alike, these \nkittens have inherited genes from both parents and \nshare many of the same characteristics. (credit: \nPieter & Renée Lanser / Concepts of Biology \nOpenStax)", "Access for free at https://openstax.org/   5 Homeostasis  \nEven the smallest organisms are complex and require multiple regulatory mechanisms to \ncoordinate internal functions, such as the transport of nutrients (Figure 1.7) , response to stimuli, \nand coping with environmental stresses . Homeostasis  or “steady state” is the ability of an \norganism to regulate and maintain constant internal conditions.", "Cells require appropriate conditions such as proper temperature, pH, and concentrations of \nnutrients to function correctly. Although these conditions may  change, organisms can maintain \ninternal conditions within a narrow range. For example, many organisms regulate their body \ntemperature in a process known as thermoregulation. Organisms that live in cold climates, such \nas the polar bear (Figure 1.8), have b ody structures such as thick layers of fur or fat, which help \nthem withstand low temperatures and conserve body heat. In hot climates, plants carry out \nunique versions of photosynthesis to reduce water loss and optimize their potential of making \nsugar.", "Figure 1.8a. Polar bears and other mammals living in ice -covered regions keep their body \ntemperature relatively constant, even though the environment can be very hot during the day and \ncold at night . (credit: \"longhorndave\"/ Flickr) b. Polar bear maintain their body temperature by \ngenerating heat and reducing heat loss through thick fur and a dense layer of fat under their skin . In this infrared image the polar b ear‘s body heat hardly registers; only the uninsulated eyes and \nmouth show temperatures significantly warmer than the environment . (credit: \nArno/Coen/Wikimedia Commons ) \na b \n6  Return to Table of Contents  Organisms like humans (Figure 1.9), use their skeletal muscles to generate heat. The contraction \nof skeletal muscles helps humans maintain stable in ternal body temperature as environmental \nconditions fluctuate. If body temperature drops below a certain point, metabolism begins to slow \nand may even stop , leading to death.", "Conversely, if body temperature rises above a certain point, \nit can lead to the d estruction of key molecules called proteins. Students that continue and take \nAnatomy and Physiology classes will spend time discussing how the body works to maintain \nhomeostasis. Students will also look at what occurs when the body loses its ability to mai ntain \nstable internal conditions, otherwise referred to as a homeostatic imbalance.", "Energy Processing  \nAll organisms, including the California condor shown in Figure 1.10, use a source of energy for \ntheir metabolic activities. Some organis ms can obtain energy through metabolic pathways such \nas photosynthesis.  Photosynthesis is a process where light energy can be captured and converted \ninto chemical energy. Organisms that are capable of making their own chemical energy are \nreferred to as autotrophs . Others must obtain their chemical energy by consuming other \norganisms. These individuals are referred to as heterotrophs . Regardless of whether an \norganism is an autotroph or a heterotroph, all living cells must have energy to drive metabolism.", "Access for free at https://openstax.org/   7 Levels of Organization of Living Things  \nLiving things are highly organized and structured. The atom is the \nsmallest and most fundamental unit of matter. It consists of a \nnucleus surrounded by electrons. Atoms form molecules. A \nmolecule  is a chemical structure consisting of at least two atoms \nheld together by a chemical bond. Many biologically important \nmolecules are macromolecules. A macromolecule  is a large \nmolecule that is typically formed by combining smaller molecules. \nFor example, nucleotides are small molecules linked together to \nform the macromolecule, DNA (deoxyribonucleic acid) (Figure \n1.11). DN A contains the instructions necessary for cells and \norganisms to maintain homeostasis.", "CONCEPTS IN ACTION - To see an animation of this DNA molecule, click here. Some cells contain collections of macromolecules surrounded by membranes; these are called \norganelles. Organelles  are small structures that exist within cells and perform specialized \nfunctions. For example, in some cells, DNA is enclosed within a membrane -bound organelle \ncalled the nucleus (plural: nuclei). All living things are made of cells; the cell is the smallest \nfundamental unit found in living organisms. Cells exhibit all of the properties of life discussed \nabove. Viruses are often not considered liv ing because they are not made of cells , nor are they \ncapable of reproducing on their own. To make new viruses, they must invade and take over a \nliving cell. Some organisms  consist of a single cell, while others are multicellular. In most multicellular \norganisms, cells combine to make tissues, which are groups of similar cells carrying out the \nsame function.", "Organs are collections of tissues grouped based on a common function. Organs \nare present not only in animals but also in plants. An organ system  is a higher level of \norganization that consists of functionally related organs. For example, vertebrate animals have \nmany organ systems, such as the circulatory system that transports blood throughout the body; it \nincludes organs such as the heart and blood vesse ls. Organisms  are individual living entities. For \nexample, each tree in a forest is an organism. Single -celled prokaryotes and single -celled \neukaryotes are also considered organisms and are typically referred to as microorganisms.", "Figure 1.12 From an atom to the entire Earth, \nbiology examines all aspects of life. (credit \n\"molecule\": modification of work by Jane \nWhitney; credit \"organelles\": modification of \nwork by Louisa Howard; credit \"cells\": \nmodification of work by Bruce Wet zel, Harry \nSchaefer, National Cancer Institute; credit \n\"tissue\": modification of work by \n\"Kilbad\"/Wikimedia Commons; credit \"organs\": \nmodification of work by Mariana Ruiz Villareal, \nJoaquim Alves Gaspar; credit \"organisms\": \nmodification of work by Peter Du tton; credit \n\"ecosystem\": modification of work by \n\"gigi4791\"/Flickr; credit \"biosphere\": \nmodification of work by NASA/  Concepts of \nBiology OpenStax )", "Access for free at https://openstax.org/   9 All the individuals living within a specific area are collectively called a population . For \nexample, a forest may include many white pine trees. All these pine trees represent the \npopulation of white pine trees in this forest. Different populations may live in the same area. The \nforest with the pine trees includes populations of flowering plants, insects, and microbial \npopulations. A community  is the set of populations inhabiting a particular area. For instance, all \nthe trees, flowers, in sects, and other populations in a forest form the forest’s community. The \nforest itself is an ecosystem. An ecosystem  consists of all the living things in a particular area \ntogether with the abiotic , or non-living, parts of that environment, such as nitrogen in the soil or \nrainwater. At the highest level of organization (Figure 1.12), the biosphere  is the collection of all \necosystems on planet Earth.", "Answer: (b) \nThe Diversity of Life  \nThe science of biology is very broad because there is a tremendous diversity of life on Earth. The \nsource of this diversity is evolution. Evolution  is the process of genetic change in a population. Evolution helps explain how new species can arise from old er species. Speciation events can \noccur when individuals within a population are separated and begin to change or evolve \nindependently of one another. If the individuals change to the point where they can no longer \ninterbreed, a speciation event has occurr ed, and species diversity has increased. Evolution will be \ndiscussed in much greater detail in chapter 11. In the 18th century, a  Swedish scientist named Carl Linnaeus first proposed organizing living \norganisms into a hierarchical taxonomy. In this system,  species that are most similar to each \nother are put together within a grouping known as a genus. Furthermore, similar genera (the \nplural of genus) are put together within a family.", "This grouping continues until all organisms are \ncollected together into gr oups at the highest level. The current taxonomic system now has eight \nlevels in its hierarchy, from lowest to highest, they are species, genus, family, order, class, \nphylum, kingdom, and domain (Figure 1.13).", "10  Return to Table of Contents    \nFigure 1.13 This diagram shows the levels of taxonomic hierarchy for a dog, from the broadest \ncategory—domain—to the most specific —species. (credit: Fowler et al./Concep ts of Biology \nOpenStax )", "The highest taxonomy level, domain, is a relatively new addition  (1990's) to the system. \nScientists now recognize three domains of life : the Eukarya, the Archaea, and the Bacteria. The \ndomain Eukarya is very diverse and includes the kingdoms of fungi, plants, animals, and several \nkingdoms of protists. Humans, plants, yeast, and mushrooms are just a few representatives of the \ndomain Eukarya . These organisms are classified as eukaryotes  because they have nuclei and \nother membrane -bound organelles. Both the Archaea and Bacteria are single -celled organisms \nclassified as prokaryotes (Figure 1.14). Prokaryotes  are organisms that lack nuclei and o ther \nmembrane -bound organelles. Prokaryotes , like eukaryotes , are very diverse and can be \nsubdivided into phyla, class, order, etc.", "Figure 1.14 These images represent different domains. The scanning electron micrograph shows \n(a) bacterial cells belong to  the domain Bacteria, while the (b) extremophiles, seen all together as \ncolored mats in this hot spring, belong to domain Archaea. Both the (c) sunflower and (d) lion \nare part of the domain Eukarya. (credit a: modification of work by Rocky Mountain \nLaboratories, NIAID, NIH; credit b: modification of work by Steve Jurvetson; credit c: \nmodification of work by Michael Arrighi; credit d: modification of work by Frank Vassen / \nConcepts of Biology OpenStax )", "Access for free at https://openstax.org/   11 Evolution in Action  - Carl Woese and the Phylogenetic Tree  \nThe evolutionary relationships of various life forms on Earth can be summarized in a \nphylogenetic tree. A phylogenetic tree  is a diagram showing the evolutionary relationships \namong biological species based on similarities and differences in genetic or phy sical traits or \nboth. \nThe pioneering research of American microbiologist Carl Woese  at the University of Illinois  has \nshown that life on Earth has evolved along three lineages, now called domains. The phylogenic \ntree in Figure 1.15 can be used to show the separation of living organisms into those three \ndomains: Bacteria, Archaea, and Eukarya.", "Branches of Biological Study  \nThe scope of biology is broad and therefore contains many branches and sub -disciplines. For \ninstance, molecular biology studies biological processes at the molecular level, including \ninteractions among molecules such as DNA, RNA, and proteins. Microbiology is the study of the \nstructure and function of microorganisms. It is quite a broad branch itself, and depending on the \nsubject of study, there are also microbial physiologis ts, ecologists, and geneticists, among others.  \nPaleontology, another branch of biology, uses fossils to study life’s history (Figure 1.16). \nZoology and botany are the study of animals and plants, respectively. Biologists can also \nspecialize as biotechnolog ists, ecologists, or physiologists, to name just a few areas.", "12  Return to Table of Contents  Biotechnologists apply the knowledge of \nbiology to create useful products. Ecologists \nstudy the interactions of organisms in their \nenvironments. Physiologists study the \nworkings of cells, tissu es, and organs. This is \njust a small sample of the many fields that \nexist within biology.", "CAREER CONNECTION  - Forensic Scientist  \nForensic science is the application of science to answer questions related to the law. Biologists, \nas well as chemists and biochemists, can be forensic scientists. Forensic scientists provide \nscientific evidence for use in courts, and their job involves examining trace materials associated \nwith crimes. Interest in forensic science has increased in the last few years, possibly because of \npopular television shows that feature forensic scientists on the job . The development of molecular techniques and the establishment of DNA databases have updated \nthe types of work that forensic scientists can do. Their job activities are primarily related to \ncrimes against people, such as murder, rape, and assault. Their w ork involves analyzing samples \nsuch as hair, blood, and other body fluids , and processing DNA (Figure 1.17a) found in many \ndifferent environments and materials.", "Forensic scientists also analyze biological evidence left at \ncrime scenes, such as insect parts  or pollen grains (Figure 1.17b). Students who want to pursue \ncareers in forensic science will most likely be required to take chemistry and biology courses as \nwell as some intensive math courses.", "Figure 1.17a This forensic scientist works in a DNA extraction lab. (credit: U.S. Army CID \nCommand Public Affairs/ Concepts of Bio logy OpenStax ) b. This scientist uses microscopy for \nsample analysis. (credit: National Cancer Institute / Public Domain )", "Access for free at https://openstax.org/   13 Section Summary  \nBiology is the scie nce of life. All living organisms share several key properties such as order, \nresponse to stimuli, reproduction, adaptation, growth and development, homeostasis, and energy \nprocessing. Living things are highly organized following a hierarchy that includes atoms, \nmolecules, organelles, cells, tissues, organs, and organ systems. Organisms are grouped as \npopulations, communities, ecosystems, and the biosphere. Evolution is the source of the \ntremendous biological diversity on Earth today. A diagram called a phy logenetic tree can be used \nto show evolutionary relationships among organisms. Biology is very broad and includes many \nbranches and sub -disciplines. Examples include molecular biology, microbiology, neurobiology, \nand ecology , among others. Exercises  \n1. Which of the following statements is false? a. Tissues exist within organs which exist within organ systems. b.", "3. Which of the following sequences represents the hierarchy of biolog ical organization \nfrom the most complex to the least complex level?  \na. organelle, tissue, biosphere, ecosystem, population  \nb. organ, organism, tissue, organelle, molecule  \nc. organism, community, biosphere, molecule, tissue, organ  \nd. biosphere, ecosystem, community, po pulation, organism", "Answers \n1. (b) \n2. (c) \n3. (d) \n4. Evolution leads to genetic changes in a population. For example, if you had a population of \ninsects that live on a maple tree, some insects may begin to feed selectively on the bark of the \ntree, while others may selectively feed on the leaves. Over time, genetic changes can occur that \nmay prevent these two groups from breeding with one another. In this case, a speciation event has \noccurred, increa sing species diversity.", "14  Return to Table of Contents  Glossary  \natom: a basic unit of matter that cannot be broken down by normal chemical reactions  \nautotroph: an organism that can make its own food from materials in its environment  \nbiology: the study of living organisms and their inte ractions with one another and their \nenvironments  \nbiosphere: a collection of all ecosystems on Earth  \ncell: the smallest fundamental unit of structure and function in living things  \ncommunity: a set of populations inhabiting a particular area  \ndomain: the highest level of the taxonomic hierarchy; includes the Eukarya, Archaea, and \nBacteria \necosystem: all living things in a particular area together with the abiotic, nonliving parts of that \nenvironment  \neukaryote:  an organism with cells that have nuclei and membra ne-bound organelles  \nevolution: the process of gradual change in a population that can also lead to new species arising \nfrom older species  \nheterotroph: an organism that cannot make its own food and must consume other organisms to \nobtain its energy  \nhomeostas is: the ability of an organism to maintain constant internal conditions  \nmacromolecule: a large molecule typically formed by the joining of smaller molecules  \nmolecule:  a chemical structure consisting of at least two atoms held together by a chemical bond  \norgan: a structure formed of tissues operating together to perform a common function  \norgan system:  the higher level of organization that consists of functionally relate d organs \norganelle: a membrane -bound compartment or sac within a cell  \norganism:  an individual living entity  \nphylogenetic tree: a diagram showing the evolutionary relationships among biological species \nbased on similarities and differences in genetic or phy sical traits or both  \npopulation:  all individuals within a species living within a specific area  \nprokaryote: a unicellular organism that lacks a nucleus or any other membrane -bound organelle  \ntissue: a group of similar cells carrying out the same function", "Figure 1.18   (a) cyanobacteria seen through a light microscope are some of Earth’s oldest life \nforms (b) stromatolites along the shores of Lake Thetis in Western Australia are ancient \nstructures formed by the layering of cyanob acteria in shallow waters. (credit a: modification of \nwork by NASA; scale -bar data from Matt Russell; credit b: modification of work by Ruth Ellison \n/ Concepts of Biology OpenStax )", "Biology is a science that gathers knowledge about the natural world (Figure 1.18). Specifically, \nbiology is the study of life. Biological discoveries are made by a community of researchers who \nwork both individually and together using agreed -on methods. The methods of science include \ncareful observation, record keeping, logical and mathematical reasoning, ex perimentation, and \nsubmitting conclusions to the scrutiny of others. Science also requires considerable imagination \nand creativity; a well -designed experiment is commonly described as elegant or beautiful. \nScience has significant practical implications and  applications, for example, in the prevention of \ndisease (Figure 1.19). Other types of science are motivated by curiosity. Whatever its goal, there \nis no doubt that science, including biology, has transformed human existence and will continue \nto do so."]