["Welcome to the Brain Rock Quiz by the years. We will begin in 2024 and year by year make our way to 2014. There's 100 questions total so lock in and here we go. Can you pass the 2024 Brain Rock Quiz? Remember to like the video and lock in. Question 1. Fill in the blank. There ain't no party like a blank. There ain't no party like a ditty party. Question 2. What move in bed makes a man go crazy? That hog tour? Question 3. Going off of the last question, what was the name of the podcast made from the hog tour", " Question 3. Going off of the last question, what was the name of the podcast made from the hog tour meme? That is talk tour. Question 4. What YouTuber secretly lost 250 pounds and shocked the internet? That was Nicocato avocado. Question 5. What are the names of the two Costco guys? That is AJ and Big Justice. Question 6. What mean from January is Ninja still dragging to this day? That was if he got a low taper fade? Question 7. What saying pops in your head when you see this image? Brain-rotted individual", "per fade? Question 7. What saying pops in your head when you see this image? Brain-rotted individuals would say green FN. Question 8. Who is your sunshine? That was Drakey Poo and Kendrick Lamar. Final question. Finish the lyric. We can go get for get. Frick that we can go risk for risk. Can you pass the 2023 Brain-rot quiz? Remember to comment your final score in locking. If you have a chance to win, you can go get a chance to win. Can you pass the 2023 Brain-rot quiz? Remember to comment your final score ", " go get a chance to win. Can you pass the 2023 Brain-rot quiz? Remember to comment your final score in locking. Question 1. Fill in the blank. Let him blank now, I said. Let him blank. Let him cook. Question 2. Who risked up Livy Dunn? That was of course baby grunk. Question 3. What is considered the weirdest state in America? That is Ohio. Question 4. What pig calls you at 3am? That is John Park. Question 5. Who sings this? That is Don Poyo. Question 6. What is this hideous toilet called? That is Skibbitty", " Who sings this? That is Don Poyo. Question 6. What is this hideous toilet called? That is Skibbitty toilet. Question 7. Finish the lyric. That is Lonely. Question 8. What is this thing called? That is a Smurfcat. Question 9. What shake did McDonald's release that turned into Brain-rot? That was the Grimmest Shake. Final question. Fill in the blank. Level 10. Yes! Can you pass the 2022 Brain-rot quiz? Subscribe toatebecomeSigma.com in lock. Question 1. Finish the bar. Which words do you want to call butt fl", "be toatebecomeSigma.com in lock. Question 1. Finish the bar. Which words do you want to call butt fly? Question a B. What is your name? What are the names of these light-skinned M.A.S.? They are Kumalala and Cellbester. Question four, finish the lyrics! H-h-h-h-h-h-h-h-h-h-h, I'll be poppin' laddos! The spark goes in jamming! Question five, what is it called when you beat it for so long you start hallucinating? That's gooning. Question 6. Who is this goat that trolled I show speed? That is my talking bin. Q", "g? That's gooning. Question 6. Who is this goat that trolled I show speed? That is my talking bin. Question 7. What is this brain rot animal used in many 2022 edits? That is the capybara. Question 8. Finish the brain rot sentence. Another day, another... Victory 40 OG. Question 9. What is Squidward doing right now? He is mowing. Final question. Finish the lyric that was heavily used on TikTok. On the biggest... Burn on the biggest... And you passed the 2021 brain rot quiz? This year was monumental for brain", ".. Burn on the biggest... And you passed the 2021 brain rot quiz? This year was monumental for brain rot so lock in. Question 1. What is speed about to say? That's what? That's what I... Okay! Question 2. What is this monstrosity? That is dubaby car. Question 3. What is this cat's name? That is big flampa. Question 4. What word invented by Kaizenat is short for charisma? That is ris. Question 5. What is this man about to say? Question 6. What word was popularized by your rage? That means a nice shaped booty", "man about to say? Question 6. What word was popularized by your rage? That means a nice shaped booty. That is kiyad. Question 7. What is this emoji doing? He is shee-shing. Question 8. What does this guy say? Question 9. Finish the lyric. What you know about rolling down in the... Deep. Final question. How much money is this Fortnite card? Okay. $19. Fortnite card. Can you pass the 2020 brain rot quiz? Getting an 8 out of 10 gives you automatic unsatisfaction? Question 1. What is this deep fried dance calle", "g an 8 out of 10 gives you automatic unsatisfaction? Question 1. What is this deep fried dance called? That is the coffin dance. Question 2. What game comes to mind when you hear the word sus? It should be among us. Question 3. Finish the legendary saying. Oh, a cool ambulance! Cool ambulance! But not for me. Question 4. What was the super famous tick tocker that made goofy faces to the beat of the music? That was Bella Ports. Question 5. Finish the sentence. We need 20 just got... Even crazier. Question 6.", "t was Bella Ports. Question 5. Finish the sentence. We need 20 just got... Even crazier. Question 6. What did this referee say after saving the people behind the camera? You ladies alright? Question 7. Finish the sentence. My friend here Justin. He's already taken. And he's cracked up for it right my guy. Question 8. What is this weird creature? That is the glob-gob-gob-gob-gob-gob-gob-gob-gob-gob. Question 9. Finish the lyric. I'm in the ghetto. That's the dog. Final question. What tick tocker who still ha", ". Finish the lyric. I'm in the ghetto. That's the dog. Final question. What tick tocker who still has the most followers on the platform is now never heard of? That is Charlie Demelio. Can you pass the 2019 Brain Rock quiz? If you get an 8 out of 10 or higher your valid. Question 1. What caption went under this image? I'd him a head out. Question 2. What is this creature? That is Bino's. Question 3. Finish the lyric. Question 4. What dance is this kid famously known for? That's the floss. Question 5. What U", "e lyric. Question 4. What dance is this kid famously known for? That's the floss. Question 5. What US military base was going to get stormed by a bunch of redditors? It was area 51. Question 6. Fill in the blank. Level 1 crook versus level 100 blank. Level 100 mafia boss. Question 7. Finish the lyric. Question 8. What YouTube channel overtook PewDiePie and subscribers to become the new number 1? That was T-series. Question 9. Finish the movie lyric. Here he comes. I like the beat. I like the joke here. Ques", "ries. Question 9. Finish the movie lyric. Here he comes. I like the beat. I like the joke here. Question 10. Finish the lyric. Can you pass the 2018 Brain Rock quiz? Question 1. What famous streamer has Ligma? That was Ninja. Question 2. What YouTuber went into a forest and recorded a dead guy? That was Logan Paul. Question 3. What NBA star was on the Sprite cranberry commercial? That was the goat LeBron James. Question 4. Finish the sentence. One-futtered... Demise Bugette! Question 5. What game absolutely", "s. Question 4. Finish the sentence. One-futtered... Demise Bugette! Question 5. What game absolutely blew up in this year? That was Fortnite. Question 6. Finish the iconic sentence. Number 15. Burger King Foot lettuce. Question 7. What's this dog's name? That is Walter. Question 8. What's this alien about to say? Question 9. What YouTuber was battling PewDiePie for his number 1 subscriber spot? That was T-series. Question 10. What store did the Yodeling Kid perform in? That was Walmart. And you passed the 2", "ies. Question 10. What store did the Yodeling Kid perform in? That was Walmart. And you passed the 2017 Brain Rock quiz? Comment your final score at the end and lock in. Question 1. Finish the lyric. Question 2. What's the name of the cash me outside girl? That was Bad Baby. Question 3. What's the name of this iconic video game character? That is Crash Bandicoot. Question 4. What brothers became two of the most hated people on the internet? That is the Paul Brothers. Question 5. Finish the iconic lyric. Que", "st hated people on the internet? That is the Paul Brothers. Question 5. Finish the iconic lyric. Question 6. What TV character is known to be a pickle? That is Pickle Rick. Question 7. Fill in the blank. Do you know thee? Do you know Dway? Question 8. What did people flip to try and land? That was Waterbottles. Question 9. What is this man's city? That is England. Question 10. What is... Can you pass the 2016 Brain Rock quiz? Getting over an 8 out of 10 makes you a legend. Question 1. What guerrilla tragica", " Brain Rock quiz? Getting over an 8 out of 10 makes you a legend. Question 1. What guerrilla tragically passed away after a kid invaded his enclosure? That was Harambe. Question 2. Finish the legendary sentence. We need to build a... Wall. Question 3. Who is this underground rapper? That's Biggie Cheese. Question 4. Finish the Grammy winning lyrics. I'm Bo-Pan. I'm Bo-Pan. I'm gay. I'm a absolute goat. That is Dad Boy. Question 8. What is Squidward about to do? Question 9. What mobile game does this kid pla", "s Dad Boy. Question 8. What is Squidward about to do? Question 9. What mobile game does this kid play every day? That's Pokemon Go. Final question. Finish the iconic saying. Get the fuck out of my room and play! Microw! Can you pass the 2015 Brain Rock quiz? If you get below an 8 out of 10 you're a new Jan. Question 1. Finish the saying. Oh! He needs... Some milk. Question 3. What does MLG stand for? That is Major League Gaming. Question 4. Finish the legendary saying. These nuts. Got it! Question 5. What s", "Major League Gaming. Question 4. Finish the legendary saying. These nuts. Got it! Question 5. What song did this meme format come from? That was Drake's Hotline Bling. Question 6. Finish the inspirational sentence. Just do it! Don't let your dreams be dreams. Question 7. What is the meme snack and drink? That is Doritos and Mountain Dew. Question 8. Finish this kid sentence. Yeah! That was... Legit-ness. Question 9. Finish this generational sentence. Lion. Final question. What is this triangle's name? The I", "tion 9. Finish this generational sentence. Lion. Final question. What is this triangle's name? The Illuminati. Can you pass the 2014 Brain Rock quiz? Not knowing these is Loki's ad. Question 1. What's 9 plus 10? 21. Question 2. Finish the lyric. Question 3. What celebrity is known for this song? Question 4. Who is this adorable dog? That is Doge. Question 5. Finish the saying. Do a barrel. Question 6. What challenge made people put two pencils on top of each other to summon a demon? That was the Charlie Cha", "allenge made people put two pencils on top of each other to summon a demon? That was the Charlie Charlie challenge. Question 7. Finish the famous lyric. Question 8. What challenge made people pour ice over their heads? That was the ALS Ice Bucket Challenge. Question 9. Finish the legendary lyric. Final question. What key do you press to pay respects? That is the F key."]