["This edition published in 2008 by Arcturus Publishing Limited \n26/27 Bickels Yard, 151–153 Bermondsey Street, London SE1 3HA\nCopyright © 2008 Arcturus Publishing Limited\nAll rights reserved. No part of this publication may be reproduced,\nstored in a retrieval system, or transmitted, in any form or by anymeans, electronic, mechanical, photocopying, recording or otherwise,without written permission in accordance with the provisions of theCopyright Act 1956 (as amended). Any person or persons who do anyunauthorised act in relation to this publication may be liable to criminal prosecution and civil claims for damages.\nISBN: 978-1-84858-008-4Printed in SingaporeAuthor: Anne Rooney\nThe right of Anne Rooney to be identified as the author of this workhas been asserted under the Copyright, Designs and Patent Act, 1988.The author can be contacted at anne@annerooney.co.uk\nGoblin illustrations by Steve Beaumont\nEditor: Kate Overy\n1001 Science 001-004 Arc.qxd  16/4/08  17:05  Page 4", "Shocking Body Facts  . . . . . . . . . . 9\nShocking Animal Facts  . . . . . . . . 47\nShocking Creepy Creature Facts  . . 75\nShocking Living World Facts  . . . . 95\nShocking Planet Earth Facts  . . . . 119\nShocking Space Facts  . . . . . . . . 143\nShocking Technology Facts  . . . . . 1691001 Science 005-008 Arc.qxd  16/4/08  17:05  Page 5", "Prepare to be zapped! Electricity isn’t the only thing in science that’s shocking. Some scientists\nexperiment by digging around in rubbish dumps or poking throughthings that come out of the wrong end of animals! Others chase big,slithering worms that live inside your body or work with poisons sodeadly, a single bottle could kill everyone on earth...let’s hope they don’thave gooey worm slime on their hands when they pick up the bottle!There are even scientists who watch dead bodies rot or send messagesinto space to try to talk to aliens for a living. It’s no wonder we think ofmad scientists and nutty professors – some of the things they get up toare truly shocking! Science helps us to explore the world and the universe around us and\nit uncovers some pretty weird and wonderful stuff. But if you thoughtscientists knew everything, think again – we don’t know what 97 percent of the universe is made of!", "Sports science\nEven extreme sports like surfing, snowboarding and skydiving are\nfuelled by the power of science! Here are a few free skydiving facts(not part of your 1001 total) to get your heart racing! Skydivers fall through the sky at speeds of 190 kilometres (120 miles)\nper hour! It’s the force of gravity that pulls them back down to Earth. As a skydiver falls, super-fast wind is slowed as it enters their airways\nto help them breathe. Oxygen is also absorbed through their skin. Scientists developed a vertical wind tunnel that blows air upwards at\nhuge speeds so that skydivers can have their fun indoors! A formula for fun\nScience really is amazing! Did you know there’s a tree that cuts itsown branches off? And a type of male fish that lives inside its femalemate? Or that the land mammal with the most teeth doesn’t actuallyuse any of them? Do you know how long a lightning bolt is? How fastraindrops fall? Or which plant can live for 10,000 years? No?", "Don’t do anything shocking…\nIf your hair is standing on end with excitement after reading all\nthe electrifying facts in this book, you might feel inspired to try\nsome experiments of your own! A word of advice…stick to\nthings like using laughter to combat your allergies, or keeping a\nrecord of whether you’ve eaten a car’s weight in food in a year!\nLeave the truly shocking tests like drinking your own vomit to\nall the mad scientists out there…1001 Science 005-008 Arc.qxd  16/4/08  17:06  Page 8", "10\nIf a person is struck by lightning, they sometimes vaporize\n(evaporate) completely, so that there is nothing left of them at all.\nBacteria trapped inside a salt crystal for\n250 million years were revived and grown by scientists in the USA.\nAn adult human takes about 23,000\nbreaths per day.\nIt takes less than 0.1grams (0.004 ounces) ofpoison found in parts of thepufferfish to kill an adult human.However, some people eat the fish regularly as they know which bits to remove!\nDead bodies can remain perfectly intact after many\nyears. This can happen when fat in the body turnsinto a type of soap that doesn’t rot.\n1001 Shocking Science Facts\nAn Anglo-American\ncompany will store \nsamples of your  \ndisease-fighting white \nblood cells, so that\nmore can be made \nif you get ill.", "11\nMalaria is a tropical disease spread by\nmosquitoes. Since the Stone Age,\nmalaria has been responsible for\nhalf of all human deaths\nfrom illness.\nEach person’s\ntongue print \nis unique.\nIn ancient times, Indian doctors used \nlive ants to ‘stitch’ wounds together.The doctor would hold the edgestogether and get the ant to bite throughthe skin.The ant’s head would then besnapped off leaving its jaws as the ‘stitch’! Some people are ‘human calculators’ and can do really\ncomplicated sums in their heads instantly – even faster thansomeone with a calculator! No one knows exactly how theirbrains are different.Shocking Body Facts\nIf scientists \ncould build a brain \nfrom computer chips,\nit would take a million\ntimes as much power \nto run as a real \nhuman brain.", "1001 Shocking Science Facts12\nEating asparagus produces a chemical that makes urine smell\nstrongly, although not everyone can smell it. Lucky them!\nA sneeze travels at 161 kilometres (100 miles) per hour.A body left unburied in a tropical climate\nwill be reduced to a skeleton in twoweeks by the action of insects.\nPeople can be born with ears\ngrowing from their necks or chests.\nThere are more bacteria in \nyour mouth than there are people in the whole world!Your brain receives about 100 million pieces of information at\nany one moment from your eyes, nose, ears, skin andreceptors inside your body.", "Shocking Body Facts13\nRubbing yourself with a garlic clove is\nsupposed to keep mosquitoes away...\nand vampires... and probably \nother people, too!\nPeople are taller in the morning\nthan in the evening. During the day,\nthe weight of your body compresses\nyour spine as you walk around, then when\nyou are asleep it expands again.\nThe spice nutmeg is harmless if eaten in moderation,\nbut deadly poisonous if injected. Beware!\nY our stomach lining replaces itself every three days.\nIf you could lay out all the possible nerve connections in your\nbrain, end to end, they would stretch to about 3.2 millionkilometres (2 million miles).Electrical activity is detectablein a human brain up to 37hours after death, possibly caused by chemical reactions.More people \nare allergic to cows’ \nmilk than to any other \nfood or drink.", "Y our eyes take about an hour to get accustomed\nto the dark, but after that they are 100,000times as sensitive to light as they are inbright sunlight.\nY our skin is shed and regrown about\nevery 27 days. Most people getthrough around 1,000 skins in alifetime.\nY our body destroys or loses two and a half\nmillion red blood cells every second. Luckily, it createsmore at the same rate!\n1001 Shocking Science Facts14\nThe strongest muscle in your body is your tongue!\nIf you read a novel that’s 100,000 words long (about 300 pages)\nyour eyes will travel just under 1 kilometre (more than half a mile)along the pages.\nThere have been many cases of people spontaneously bursting\ninto flames and dying. Often, their whole body is burnedaway. No one knows exactly why this \nspontaneous human\ncombustion happens. What a way to go!\nThere is\nenough acid in the\nhuman digestive\nsystem to dissolve \nan iron nail\ncompletely.", "15\nWomen blink twice as often as men.\nThe placenta, which nourishes an unborn\nbaby, is the only organ that develops after a\nperson is fully grown. It is lost when thebaby is born and another grows if thewoman becomes pregnant again.\nOne in 512,000 births results in triplets.Only a few hundred people in the world are\nknown to have the rare blood type H-H.A person with H-H blood can’t receiveblood transfusions of any other blood typeand may need to store their own blood inadvance of an operation.There is enough iron in your body to make a nail...which you\ncould then dissolve in all the acid!Shocking Body Facts Beard hair grows faster than any other hair on the human\nbody. If left to grow for his whole life, a man’s beard could be9 metres (30 feet) long.", "1001 Shocking Science Facts16\nWhen you hold a seashell to your ear\nto ‘hear the sea’, what you actuallyhear is your own blood in theblood vessels of your ear.\nIf you could join up all the\neyelashes you will lose duringyour lifetime they would stretchto about 30 metres (100 feet).\nHair grows most quickly during the\nday in the summertime. It grows moreslowly at night and in winter.\nFor years, doctors thought the appendix in the gut\ndidn’t do anything. But in 2007, scientists\ndiscovered that it helps to grow new helpful\nbacteria if vital bacteria in the gut are killed \nby illness.\nIf all the blood vessels from a human body\nwere laid end to end they would stretch\n97,000 kilometres (60,000 miles).People who\nhave lost a limb in\nan accident or\noperation often feel pain\nor itching in it, even\nthough it’s no \nlonger there...", "Shocking Body Facts17\nA single human hair can support the weight of an apple.\nEveryone spent about half an hour of their life as a single cell,\nat the start of their mother’s pregnancy.\nA chemical found in asparagus attracts fish.\nDuring the First World War,American soldiers were issued withasparagus so that if they werestranded near water they couldeat the asparagus, urinate in thewater and catch some fish to eat! \nIf you rubbed garlic on the\nbottom of your foot, it would beabsorbed through your skin andeventually your breath wouldsmell of garlic!You lose around two billion skin cells every day, which adds\nup to around 2 kilograms (4.5 pounds) in a year.", "1001 Shocking Science Facts18\nLaughing seems to reduce a person’s allergic responses. So if\nyou have hay fever, try laughing about it!\nAround 10 per cent of the population is left-handed, but\nboys are one and a half times more likely to be left-handedthan girls.\nThe bad smell of faeces comes from chemicals produced by\nbacteria that break down the food in your gut.\nGirls have more taste budsthan boys.\nEven though some dreams\nseem to last ages while youare experiencing them, theygenerally only take about 2-3seconds. Most people have atleast seven dreams a night.Your brain gets lighter as you get older. In your twenties, it\nstarts to lose up to a gram (0.035 ounces) a year as cells dieand are not replaced.", "It is impossible to sneeze with your eyes open.Shocking Body Facts19\nMost people spend about the same\namount of time blinking as theyspend eating \n–a total of about\nfive years over a whole lifetime.\nThe heat outputfrom the averageadult body is enoughto boil 30 litres(around 53 pints) offreezing water.\nIf all of your body’s molecules of DNA (the\nchemical which makes up your genes) werestretched out, they would reach to the Moonand back 3,000 times!The world\nrecord for holding\nyour breath is 7.5 minutes.\nMost people can only\nmanage around \n1 minute.\nThe hair of really intelligent people contains\nlarger quantities of the minerals copper andzinc than the hair of less clever people.", "1001 Shocking Science Facts20\nWhen you sneeze, all of your bodily\nfunctions stop momentarily.\nAn average person falls asleep in\nseven minutes.\nBeing cold in the night tends to give\nyou bad dreams.The colder the room,the more likely you are to have a baddream.Wrap up warm tonight!\nAbout 125 grams (5 ounces) of\nthe food you eat each day\ncomes out as faeces. Most\nof the rest is water, and the\nremainder is nutrients\nabsorbed by your body.If you have your\nhead cut off, you may\nremain conscious \nand able to see \nfor several seconds \nbefore you die.\nIn the 1930s, it was not uncommon for\nwomen to swallow live tapeworms in anattempt to lose weight. The tapewormswould live in their stomachs, eating some of the food the women ate.", "Shocking Body Facts21\nIt only takes about 10 days to die from a total lack of sleep.\nPeople who live at very high altitudes have blood in their\nbodies that can deliver oxygen around the body much moreefficiently than the blood of sea-level dwellers.\nDripping concentrated chilli oil into\nopen wounds during surgery\nnumbs the nerves for weeks\nand prevents patients feeling\npain after an operation.\nA ‘body farm’ is a research\ncentre where dead bodies\nare left to decay in various\nsituations. Scientists study\ntheir decomposition and the\ninformation is used to help\npolice with murder investigations.Chewing bread\nor gum while you\npeel onions will\nprevent the onions\nmaking you cry.Your fingernails grow four times faster than your toenails.", "1001 Shocking Science Facts22\nMitochondria are parts of the cells in our bodies. Scientists\nthink that they were originally bacteria, which have become\nabsorbed into our bodies and are now an essential part ofus.They take in nutrients and make energy for our cells.\nSome substances colour your urine – ifyou eat lots of rhubarb, your urine willbe orange, and blackberries can make it go red!\nIn 1804, trainee doctor Stubbins Firth\ntried to prove that yellow fever is not \nan infectious disease by drinking hispatients’ vomit! Although he did not get yellow fever, he was wrong. It is very contagious, but must enter directly through the bloodstream.Chinese scientists are testing robot-controlled mice. They follow\ninstructions from a computer transmitted through electrodes intheir brains. Scientists are hoping to use their techniques to curedisabilities by bypassing damaged nerves.", "Shocking Body Facts23\nPeople in Pakistan have been\nvisiting the dentist for 9,000\nyears.Archaeologists have \nfound drilled and capped \nteeth in ancient skeletons \ndiscovered there.\nMost people’s ears grow a\nquarter of a centimetre \n(0.1 inches) per year for their\nwhole life.\nGenetic evidence shows that most\npeople in Britain are descended fromthe Spanish. It’s thought that Spanishfishermen colonized Britain 6,000years ago and took over from the native Britons.\nMost American fashion models are\nthinner than 98 per cent ofAmerican women.The amount \nof electrical \nenergy generated \nby your brain is\nenough to power \na light bulb!", "1001 Shocking Science Facts24\nMedical researchers studied 46 professional sword-\nswallowers and discovered that sore throats are commonamongst them, especially when they are training... howsurprising!\nResearchers think girls like pink and red colours because\nthousands of years ago their job was to hunt for ripe berries. Over the years girls’ eyes became conditioned to seek out those berry colours.\nBabies have many more tastebuds than adults.\nA chemical from bullfrogs may\nhelp doctors to wipe out thedeadly MRSA virus, whichinfects some hospital patients.Frog chemicals have been usedto treat wounds for centuries.\nNeanderthal (early) man\nhad larger brains thanpeople have now!", "Shocking Body Facts25\nOne of our closest relatives is the colugo or ‘flying lemur’.\nIt’s like a squirrel with bat-like flaps of skin between its arms,\nlegs and tail and it glides from tree to tree.After apes, it’s theanimal genetically closest to humans!\nOne in 20 people has an extra rib.\nDoctors in the old days used\nleeches to remove people’s\nblood.T oday, doctors still use\nleeches in some surgical\nprocedures, as they produce\nchemicals that kill pain and keep\nblood flowing without clotting.\nGnathostoma spinigerum is a parasitic worm that lives under\nthe skin. It moves around at a rate of about 1 centimetre (0.4 inches) per hour, so if you have one you can watch itmoving under your skin!There are around 100 million microbes living in your mouth\nat any time. They feed on scraps of food and dead cells fromyour mouth.", "1001 Shocking Science Facts26\nGas you take in with food takes between 30 and 45 minutes\nto be released as a fart. It can come out quicker as a burp.\nDandruff is made of clumps of dead skin cells mixed with \ndirt and oil from your scalp.Y ou lose millions of skin cells\neach day, so there’s plenty available to make dandruff!\nThere are 2,000 glands in your ear that\nproduce earwax.The sticky wax collects dirt,\ndead bugs and old skin cells before it falls out\nof your ears. It also kills germs!\nThe water in urine comes from your blood.\nIt goes from your food and drink through \nthe gut wall into the blood, and is taken \nfrom the blood to make urine.The name for gurgling in your stomach is borborygmus . \nIt’s caused by all the gases and half-digested food jumbling\naround and being pushed through the gut.", "Shocking Body Facts27\nMucous (slime) in your nose\ncollects all the dirt you breathe\nin, including particles of smoke,pollen, exhaust fumes \n–and\neven dust from outer space!The slime and dirt clumptogether to make bogeys.\nHalf of the bulk of faeces is bacteria.Bileis the liquid that breaks down starches in your body. It\ndetermines the colour of urine, faeces and vomit.\nThe broad tapeworm can live in your gut for decades and\ngrow to 10 metres (39 feet) in length.Y ou may not evenknow you have one...A pimple\nappears when a\nhair follicle becomes\nclogged by dried-up oil\nthat oozes out of \nthe skin.\nSweat only smells bad because bacteria break it down when\nit stays on your skin. So, if your armpits or feet smell, it’s rotting sweat helped along by colonies of bacteria.", "1001 Shocking Science Facts28\nIn the condition myiasis, maggots\nhatch out and live under the \nskin –they can even be seen\nwriggling around. In 1993,\ndoctors in Boston, USA,\ndeveloped a treatment for\nmyiasis that involved covering\nthe skin with bacon. Maggots \nlike the bacon, so come up\ntowards it. Doctors then pull \nthem out with tweezers. Gross!\nMost people pass about a litre (2 pints) \nof gas a day as burps and farts.\nBacteria can survive 10,000 times the dose of\nradiation that would kill a person.There are tiny\nhairs all over your\nbody, except for the\npalms of your hands \nand the soles of \nyour feet.\nTooth farming is an experimental\ntechnique in which scientists takedental \nstem cells (cells from immature\nteeth) and use them to growcomplete teeth. So far, only parts of atooth have been grown, but farmedteeth might replace dentures in 15years’ time.", "Shocking Body Facts29\nForensic scientists examine maggots and beetles eating dead\nbodies to try to work out the time that the person died.They work out at which stages of decomposition thedifferent bugs like to eat the body.\nWhen you vomit, the muscles that usually push the food\ndown through your gut go into reverse and push it up andout of your mouth.\nDead bodies swell up as they rot,\nbecause decomposition produceslots of gas. Some dead bodies burpor fart as they release gas, whichcan be quite alarming!\nThere are several medical\nconditions that lead people to actlike or believe they are wild animalssuch as wolves.These may explainsome of the stories about werewolves.Your stomach uses hydrochloric acid to digest your food, but if\nyou spill it on to your skin, it burns you. The stomach produces\nmucous to protect itself from the acid. When someone diesand the mucous stops, the acid starts to dissolve the stomach.", "1001 Shocking Science Facts30\nRoy Sullivan of the USA survived being\nstruck by lightning seven times andeventually committed suicide.\nPutrescine, one of the smelly\nchemicals produced by rotting\ndead bodies, is also partlyresponsible for bad breath.\nSome people pay to have their\nbodies frozen after death in casescientists work out a way to bringthem back in the future! Y ou produce\nabout a litre (about 2\npints) of saliva every day.\nIt helps to break down your\nfood before you swallow it,\nand to keep your \nteeth clean.\nWhen people die in extremecircumstances their muscles can gointo spasm and freeze in their finalposition. Forensic scientists can usethis to show that someone was stillalive when pushed into a river, forexample, or died holding a weapon.", "Shocking Body Facts31\nFleas that live on rats spread bubonic plague, which killed\naround a third of the population of Europe in the 14th\ncentury.They only started to bite humans because all the rats died.\nThe human body uses 60 calories an hour just to sleep – the\nsame as it takes to watch TV. So if you were a complete couchpotato, you would need to eat only 1440 calories a day.\nThe placenta (the organ which grows to nourish a baby inside\nits mother) uses the same biological tricks as a parasitic\nworm to hide from the mother’s immune system.Without it,the mother’s body would reject thebaby as an intruder.\nA blackhead is black\nbecause the oily gunk in itchanges to a black colouron exposure to the air.\nIf a wound gets infected,\nfind some maggots to puton it! They will eat all therotten flesh and protect youfrom gangrene.", "1001 Shocking Science Facts32\nThe nastiest form of the disease malaria can cause the blood\nvessels in the brain to clog up with dead blood cells, causing\ndeadly spasms.\nIn the First World War, soldiers used the super-absorbent\nsphagnum moss to bandage their wounds. It can soak up four\ntimes as much blood as cotton bandages, but was a disgustingcolour, like dried pus!\nThe human body contains an amazing\n10,000,000,000,000,000,000,000,000,000 atoms.\nScientists have recreated thedeadly flu virus that killed oneper cent of the entire worldpopulation between 1918 and1919. Smart, huh?\nY ou will probably produce\nenough saliva during your lifeto fill two swimming pools.", "Shocking Body Facts33\nA virus can only survive in a living host cell so it’s not in \na virus’s interest to kill you. Even so, viruses caused allpandemic illnesses except bubonic plague, so don’t get too relaxed about them!\nEarly anatomists were not allowed to studydead bodies, so they paid grave robbers tosteal them. Often, the bodies of executedcriminals were stolen and sold.\nA flea carrying bubonic plague gets\nblocked up with plague bacteria thenvomits them up into the bite it makesin its animal host.\nIf you don’t have enough water, eventually\nyour lips shrivel and go black, your tongueswells so that it won’t fit in your mouth, andyou can go nearly deaf and blind.Y our skinturns grey or purple, your breath stinks andyour spit turns gluey and smelly, and if youcut yourself you don’t bleed. So make sureyou drink up!", "1001 Shocking Science Facts34\nOccasionally a baby is born with its\nlegs fused together, but still\nwith two feet.This mutation\nmight have led to ‘true’\nstories of mermaids.\nCasper’s Law of\ndecomposition states\nthat a body left in the\nopen air decomposes\ntwice as fast as if it were\nimmersed in water and eight\ntimes faster than if it were\nburied underground.\nXenographic transplants involve taking an organ from an\nanimal and using it in a human being –a chimpanzee heart\nwas transplanted into a man in Mississippi, USA in 1964, but\nthe patient died two hours later.\nThe human stomach can hold up to 4 litres (7 pints) of partly-\ndigested food. A cow’s stomach can hold ten times as much –enough to fill a whole bath!", "Shocking Body Facts35\nStone Age people used to practise trepanning –an early\nmedical procedure that involved drilling a hole in the\nskull.They had no anaesthetics,so it must have hurt – but the patients didn’t all die –lots of skulls have been foundwith partly healed holes!\nMany cures used in ancient\ntimes really do work. One wasto put honey on wounds andthen dress them with willow bark. Honey is an antiseptic,which stops the wound going bad and willow containsthe same painkiller that’s in aspirin. Genius!\nA new way of treating cancer involves blowing bubbles\ninside the body.When the bubbles burst, they releaseheat, which kills the cancer cells.People who suffer from migraines (terrible headaches with\nsickness) have thicker brains than people who don’t.\nScientists don’t know which came first in sufferers, thethickening or the migraines.", "1001 Shocking Science Facts36\nThe latest artificial limbs can be\ncontrolled just by thought.Amazing!\nBacterial farms are used to\nproduce certain drugs. Scientistshave adapted bacteria tomanufacture the hormone insulinneeded by people with diabetes.Previously, insulin was taken fromcows and pigs.The human brain\ncontains one\nhundred billion \nnerve cells.\nA new method of transferringinformation, using the humanbody to carry the signal, meanswe could soon be able to passon material such as photos andsongs just by shaking hands!\nY our nose and ears never \nstop growing.", "Shocking Body Facts37\nSynaesthesia is a condition that jumbles up how people sense\nthings.They might ‘see’ sounds as colours, or ‘hear’ smells \nas sounds.\nY ou’re more likely to get ill from kissing another person than a\ndog. Even though a dog’s mouth has as many germs as a human’s,not as many of them are harmful to us.\nA rare response to a virus that\nnormally causes warts can also leadpeople to develop brown growths,which make them look as thoughthey are covered with tree bark.\nBefore they are born, developing\nhuman babies have a tail, and somedeveloping snake babies have legs. Perhapswe have more in common with snakes than we think!In one day, your\nblood travels \n19,312 kilometres \n(12,000 miles)!Heavier women produce brainier children! Scientists believe\nthat fat stored on a woman’s hips contains acids that areessential to the development of the unborn baby’s brain.", "1001 Shocking Science Facts38\nIt’s possible that hiccups come from our\ndistant ancestors who crawled out ofswamps and had both lungs and gills.Hiccups may be a remnant of a way ofclosing off their lungs when in the water.\nMost human mutations happen on the Y\nchromosome, which only men have.\nPeople in some countries would bind their babies’ heads\nusing wooden boards, to make them grow into strangeshapes... don’t try it with your baby brother or sister!Y our skin\nweighs about 3\nkilograms \n(6.5 pounds) – the same\nas a bag of potatoes.\nA man born in England long ago had four eyes, arranged one\npair above the other. He could close any one eyeindependently of the others.\nNecrotizing fasciitis or the ‘flesh-eating bug’ causes your flesh\nto rot, die and fall off. It can be fatal, and even people who\nrecover often lose whole chunks of their bodies.Yuk.", "Shocking Body Facts39\nZombies are not just a fictional invention.Witch doctors\ncalled bokors in Haiti, can use a special combination of plant-\nbased drugs to make a person appear to be dead, then revivethem and keep them under their control.\nBeing born with webbed hands or feet is quite common. \nIt happens because fingers and toes develop from a flipper-likehand or foot that divides on the unborn baby. If it doesn’tdivide properly, the skin stays webbed.\nSome people have an abnormality called ‘hairy tongue’ which\ngives them –you guessed it –a hairy tongue! In fact, it’s not\nhair, but extra long papillae (the little bumps on your tongue).\nThey also turn black!\nA Swiss journalist called EtienneDumont is growing horns on hishead. He has silicon implants underthe skin and as the skin grows overthem he replaces them with slightlylarger ones.\nEvery year you will eat about \n500 kilograms (1,100 pounds) offood.That’s about the same weight as a small car!", "1001 Shocking Science Facts40\nEven when you are elderly you will still have\nthe tooth enamel that was formed in\nyour mother’s womb.\nThe skin of your eyelid is only 0.5\nmillimetres (0.02 inches) thick, the\nsame width as a single hair.\nEvery day, you produce enough saliva\nin your mouth to fill five cups.\nHumans can tell the difference between\n10 million different colours.\nA traditional treatment for the pain of\narthritis is bee venom ...but then you’re \nfaced with the pain of bee stings!The skeleton of \na body buried in \nPH neutral soil or\nsand can survive for\nthousands \nof years.", "Shocking Body Facts41\nWhen girls are one and a half years old they are almost half\ntheir adult height.The same happens for boys when they are two.\nForensic dentists examine teeth and tooth marks.Their work\nincludes identifying dead bodies, and examining bite marks tomatch them to assailants.\nIn the 1700s a Russian woman had\n69 children: 16 pairs of twins,7 sets of triplets and 4 sets of quadruplets.That’s a lot ofbirthdays to remember!\nCarrots really do help you see in\nthe dark \n–they contain vitamin A,\nwhich helps the retina to develop.When you look at your tongue first thing in the morning, \nit is covered in white stuff. These are cells that died during the night.\nY ou have 10,000\ntaste buds on your\ntongue. By the time you\nare 60, half of these will\nhave died.", "42\nSome people suffer from a sleep-related\neating disorder that makes them getup in the night (while still asleep)and go to the kitchen to stuff their face!\nEbola fever is a horrible disease\nthat makes people bleed from all\ntheir body openings, and turnstheir internal organs to liquid.Victims always die.\nHuman memory recalls events seventimes faster than they really happen.\nMany victims of the flu pandemic in\n1918 went deep purple just beforedying.Their lungs were so badlydamaged by the disease that nooxygen could get into their blood.\nY ou have more bacteria than human\ncells in your body.People who\nhave been struck by\nlightning often develop\nmusical ability they did\nnot previously have!\n1001 Shocking Science Facts", "Shocking Body Facts43\nStrychnine poisoning\ncauses extreme\nmuscle spasms.They can be sosevere that thebody can jerkbackwards until theheels touch the back ofthe head and the face isdrawn into a terrifying, wide, fixed grin.\nHaving hookworms inside your body can protect you from\nasthma. Some people have deliberately infested themselveswith hookworm to get rid of their asthma.Messages are sent to your brain at around 360 kilometres (224\nmiles) per hour.\nIn 2002 German anatomist Gunther von Hagens carried out\na public autopsy, cutting up a corpse in London, England. Itwas the first public autopsy for 170 years and was illegal.Thepolice attended, but did not stop the autopsy or arrest vonHagens, and the autopsy was even broadcast on television.", "44\nIt is possible to die in just 4 minutes from choking or a\nblocked windpipe.\nThe most dangerous animal to humans is thehouse fly \n–it carries more diseases than any\nother creature.\nThe human intestine is 9 metres (nearly \n30 feet) long. Just as well it’s all coiled up! \nIn 1822 a man called Alexis St Martin was\nshot in the stomach.A doctor called WilliamBeaumont cared for him, but the wounddidn’t heal completely and the man was leftwith a hole leading right into his stomach.Beaumont used it to study the workings ofthe stomach. St Martin’s meals used to leakout of the hole unless he kept it covered!\n1001 Shocking Science Facts\n18th-century Italian scientist Lazzaro Spallanzani often made\nhimself sick to get samples of stomach acid for his experiments.", "Shocking Body Facts45\nBodies buried in a peat bog may be\nnaturally preserved for hundreds oreven thousands of years. Bog bodies\nhave dark leathery skin, but arestill recognisable.Some of the Forepeople of New Guinea suffered from a\nstrange illness that caused shaking, paralysis and death anddefied medicine for years. It was eventually discovered thatthe disease, kuru, was caused by eating the undercooked\nbrains of dead relatives, part of the Fore people’s burial ritual.A Big Mac provides 2,365 kilojoules (565 calories) of energy.\nYou’d need to cycle for 3 and a quarter hours to burn it off.\nY our heart beats about 35\nmillion times a year.\nHookworms enter through the\nfeet, are carried in the blood to thelungs, and then travel up into the throatto be swallowed.The gut is their finaldestination \n– they bite onto it and live there.", "1001 Shocking Science Facts46\nAn 11-year-old boy needs around\n10,000 kilojoules (2,388 calories)of energy from food each day.Acanary needs only 46 kilojoules(11 calories) and an elephantneeds 385,000 (91,955 calories).The boy could get his 10,000energy by eating 71 canaries or a small portion of elephant!\nBubonic plague has not gone away\ncompletely.An epidemic inVietnam between 1965 and 1970\naffected up to 175,000 people.\nAnatomist Gunther Von Hagens offered to buy the body \nof Russian basketball player Alexander Sizonenko, who is 2.39 metres (7 feet 10 inches) tall, even though he was notdead at the time! Sizonenko refused.\nPeople with the condition Cotard syndrome believe that\nthey are already dead, and are walking corpses.", "48\nIn 1945, crocodiles killed 980\nJapanese soldiers (of 1,000 in total)who entered a mangrove swampto escape the British navy.\nThe killifish lives in temporary ponds\nin Venezuela.When the ponds dry up,\nthe killifish embryos can survive in themud, with no water or oxygen, for more than60 days. No other creature can hold its breath for so long!\n1001 Shocking Science Facts\nThe cosmopolitan sailfish can swim\nfaster than a cheetah can run! It\ncan swim at least 109 kilometres\n(68 miles) per hour, while a\ncheetah can only manage 100\nkilometres (62 miles) per hour.Polar bears have\nblack skin \nunderneath their \nwhite fur.\nIn just over 100 years, the\n‘passenger pigeon’ went frombeing the most common birdin the world (in 1810) to beingextinct (in 1914).", "Shocking Animal Facts49\nThe blue whale has the slowest heartbeat of any animal \n– it only beats four to eight times a minute.\nShaving a pregnant mouse makes her produce more milk \nand grow larger babies.A bald mouse can digest more food without overheating, and so makes more milk.\nSome scientists believe that hidden\nor ‘silent’ genes can return aftermillions of years.A ‘throw back’happens if a silent gene gets turnedback on – making dolphins with legs,for example, or people who are as hairy as apes!\nA rhino’s rock-solid horn is made \nof keratin – the same substance as\nhuman hair, skin and nails.\nCats don’t like walking across\naluminium foil – they hate the noise it makes!", "1001 Shocking Science Facts50\nSavi’s shrew (a tiny mouse-like mammal) \nis so small it uses the tunnels dug bylarge earthworms.\nThe largest coprolite (fossilized dinosaur\nfaeces) measures 50 centimetres \n(19.6 inches) wide and was from aTyrannosaurus rex more than 65 millionyears ago. It weighs 7 kilograms (15 pounds 6 ounces).Some horseshoe bats in India share their\nburrows with porcupines.\nGeese can fly up to 8 kilometres \n(5 miles) above the ground.\nThe vervain hummingbird builds a nest\nhalf the size of a walnut shell and lays an\negg that’s only a centimetre (0.39 inches) long.Bats always turn \nleft when they come\nout of a cave.", "Shocking Animal Facts51\nThe only fruit eaten by aardvarks is called aardvark cucumber.\nThe cucumber grows underground and relies on the aardvark\nto spread its seeds.\nGiraffes have a special valve to help \ntheir hearts pump blood all the way up their long necks.\nMost hamsters blink with one eye\nat a time.\nA porcupine can swallow 100 times the\namount of poisonous hydrogen cyanide that is needed\nto kill a human and suffer no ill effects!\nThe emperor penguin candive to depths of 534 metres(1,751 feet) – over one and a half times deeper than ahuman scuba diver can reach.\nRodents (such as rats and\nmice) make up 40 per cent ofall mammal species on earth.Elephants are the\nonly animals with\nfour knees.", "1001 Shocking Science Facts52\nTheviperfish impales creatures on its\nteeth by swimming straight at them.\nIts needle-like teeth are so large, theydon’t even fit in its mouth fully!\nFish can’t chew.A hyena can chew a broken bottle\nwithout hurting itself.\nWhen staff at the British Museum\nsaw the first duck-billed platypus ,\nthey thought it was a fake animaland tried to pull off its bill!\nWalruses can get sunburnt! Other animals\nthat can get sunburnt, (apart from humans)are light-coloured horses and pigs.\nWoolly bats in West Africa \nlive in spider webs.Sloths move so\nslowly that algae\ngrows on their fur.", "Shocking Animal Facts53\nThe instinct to migrate is so ingrained in birds’ bodies that\neven caged birds will turn and try to fly in the direction thatthey would naturally migrate.They do it at exactly the sametime as wild birds, even though artificial light and heatingshould prevent them.\nA cat is more likely to die if it falls from the top of a seven-\nstorey building than if it falls from the top of a twenty-storeybuilding. The extra falling time gives the cat a chance torealise what is happening and land properly.\nThe polar bear has the largest stomach capacity (in relation\nto its size) of any animal. It can kill and eat a large walrus oreven a beluga whale.\nThe armadillo has more teeth\nthan any other land mammal\n(around 100). However, it\nmostly gobbles up termites\nand ants, which don’t need\nbiting or chewing! \nAn anteater can eat 30,000\nants a day.", "1001 Shocking Science Facts54\nA cockerel that was\ninexpertly beheaded in1945 lived for 18 months without itshead! The farmer whoowned the cockerelnamed him Mike, tookhim on tour andearned a small fortune!Only ten per cent of the animal species that have ever existed arestill alive today.\nUsing sonar equipment, scientists can detect the sounds made by\nfin whales and blue whales from 850 kilometres (350 miles) away.\nThe male elephant seal inflates its snout during mating. Once\nit’s inflated, it can reach into its own mouth. Why would itneed to suck its nose?An African elephant kept in the New York Zoo had tusks \nthat were 3.49 and 3.35 metres (11 feet 5 inches and 10 feet 11 inches) long!", "Shocking Animal Facts55\nA bird called the bar-tailed godwit migrates\n11,500 kilometres (7,146 miles) from\nAlaska (near the North Pole) to NewZealand, flying non-stop. It loses up to55 per cent of its body weight on the way.\nCats and dogs have sometimes travelled\nvast distances back to their original homesafter their owners have moved house. No oneknows how they do this so accurately.\nAn early ancestor ofTyrannosaurus rex is believed to have had feathery hair on its jaws and at the tip of its tail.The star-nosed mole can\nidentify, capture and eat its\nprey in just over a tenth ofa second.Tigers have striped\nskin as well as\nstriped fur."]