["Trivia Questions\nTrivia Questions & \nAnswers\n\nTrivia Question: What is the rarest M&M color?\nAnswer: Brown\nTrivia Question: In a website browser address bar, what does “www” stand for?\nAnswer: World Wide Web\nTrivia Question: In what year were the first Air Jordan sneakers released?\nAnswer: 1984\ntrivia questions\nTrivia Question: In a game of bingo, which number is represented by the phrase “two little \nducks”?\nAnswer: 22", "Trivia Question: According to Greek mythology who was the first woman on earth?\nAnswer: Pandora\nTrivia Question: Samuel Tilden, Grover Cleveland, Al Gore and Hillary Clinton share what \ndistinction among U.S. presidential candidates?\nAnswer: They won the popular vote, but lost the electoral-college vote\nTrivia Question: Which African country was formerly known as Abyssinia?\nAnswer: Ethiopia", "Trivia Question: Tennis star Serena Williams won which major tournament while pregnant \nwith her first child?\nAnswer: The Australian Open\nTrivia Question: In which European city would you find Orly airport?\nAnswer: Paris\ntrivia questions\nTrivia Question: Which singer’s real name is Stefani Joanne Angelina Germanotta?\nAnswer: Lady Gaga\nTrivia Question: The only known monotremes in the animal kingdom are the echidna and \nwhich other creature?\nAnswer: The platypus", "Trivia Question: Kingston, Zuma, and Apollo are the sons of which American female pop star?\nAnswer: Gwen Stefani\nTrivia Question: Fissures, vents and plugs are all associated with which geological feature?\nAnswer: Volcanos\nTrivia Question: Which author wrote the ‘Winnie-the-Pooh’ books?\nAnswer: A. A. Milne\nTrivia Question: Which Dutch artist painted “Girl with a Pearl Earring”?\nAnswer: Vermeer\ntrivia questions", "Trivia Question: Where were the Declaration of Independence, the Constitution, and the Bill \nof Rights stored during World War II?\nAnswer: Fort Knox\nTrivia Question: Which country consumes the most chocolate per capita?\nAnswer: Switzerland\nTrivia Question: Which two U.S. states don’t observe Daylight Saving Time?\nAnswer: Arizona and Hawaii\nTrivia Question: What is the loudest animal on Earth?\nAnswer: The sperm whale", "Trivia Question: What was the first toy to be advertised on television?\nAnswer: Mr. Potato Head\ntrivia questions\nTrivia Question: What is the tiny piece at the end of a shoelace called?\nAnswer: An aglet\nTrivia Question: In the United Kingdom, what is the day after Christmas known as?\nAnswer: Boxing Day\nTrivia Question: Which of Shakespeare’s plays is the longest?\nAnswer: Hamlet\nTrivia Question: Outside which New Y ork building was John Lennon killed?\nAnswer: The Dakota Building", "Trivia Question: How many of Snow White’s seven dwarfs have names ending in the letter Y?\nAnswer: Five: Dopey, Grumpy, Sneezy, Sleepy, Happy\nTrivia Question: I Know Why the Caged Bird Sings’ is the autobiography about the early years \nof what inspirational African-American writer and poet?\nAnswer: Maya Angelou\nTrivia Question: What is the tallest breed of dog in the world?\nAnswer: The Great Dane\ntrivia questions\nTrivia Question: What is the softest mineral in the world?\nAnswer: Talc", "Trivia Question: Lateral Epicondylitis is a condition commonly known by what name?\nAnswer: Tennis Elbow\nTrivia Question: Who was the first female Prime Minister of Great Britain?\nAnswer: Margaret Thatcher\nTrivia Question: How many ribs are in a human body?\nAnswer: Twenty-four\nTrivia Question: What is the world’s biggest island?\nAnswer: Greenland\nTrivia Question: Which country is known as the Land of White Elephant?\nAnswer: Thailand", "Trivia Question: What is the smallest ocean in the world?\nAnswer: The Arctic\nTrivia Question: What color eyes do most humans have?\nAnswer: Brown\nTrivia Question: In which city was Anne Frank’s hiding place?\nAnswer: Amsterdam\nTrivia Question: What is the largest type of deer?\nAnswer: The moose\nTrivia Question: Which Disney film features the song ‘When Y ou Wish Upon a Star’?\nAnswer: Pinocchio\nTrivia Question: What is the lowest army rank of a US soldier?\nAnswer: Private", "Trivia Question: Before the Beatles were formed, John Lennon, Paul McCartney and George \nHarrison were originally members of which group?\nAnswer: The Quarrymen\nTrivia Question: What is the name of the Earth’s largest ocean?\nAnswer: The Pacific Ocean\nTrivia Question: When Michael Jordan played for the Chicago Bulls, how many NBA Champi -\nonships did he win?\nAnswer: Six\nTrivia Question: What country won the very first FIFA World Cup in 1930?\nAnswer: Uruguay", "Trivia Question: In what year was the first ever Wimbledon Championship held?\nAnswer: 1877\nTrivia Question: What is often seen as the smallest unit of memory?\nAnswer: kilobyte\nTrivia Question: Which planet is the hottest in the solar system?\nAnswer: Venus\nTrivia Question: Which country produces the most coffee in the world?\nAnswer: Brazil\nTrivia Question: What is the common name for dried plums?\nAnswer: Prunes\nTrivia Question: What does BMW stand for (in English)?\nAnswer: Bavarian Motor Works", "Trivia Question: Which two countries share the longest international border?\nAnswer: Canada and the USA\nTrivia Question: What is the smallest country in the world?\nAnswer: Vatican City\nTrivia Question: Which bone are babies born without?\nAnswer: Knee cap\nTrivia Question: Which name is rapper Sean Combs better known by?\nAnswer: P . Diddy\nTrivia Question: Which British girl group had a member by the name of Mel B?\nAnswer: Spice Girls\nTrivia Question: How many hearts does an octopus have?\nAnswer: Three", "Trivia Question: How many eyes does a bee have?\nAnswer: Five\nTrivia Question: What was the name of the rock band formed by Jimmy Page?\nAnswer: Led Zeppelin\nTrivia Question: Who was the first woman to win a Nobel Prize (1903)?\nAnswer: Marie Curie\nTrivia Question: Which mammal has no vocal cords?\nAnswer: Giraffe\nTrivia Question: What type of music has been shown to help plants grow better and faster?\nAnswer: Classical\nTrivia Question: Power outages in the US are mostly caused by what?\nAnswer: Squirrels", "Trivia Question: What celebrity has their dog cloned– twice?\nAnswer: Barbara Streisand \nTrivia Question: What was the first state?\nAnswer: Delaware \nTrivia Question: What is the painting ‘La Gioconda’ more usually known as?\nAnswer: Mona Lisa\nTrivia Question: Ludwig Van Beethoven was born in 1770 in which city?\nAnswer: Berlin\nTrivia Question: Water as a pH level of around?\nAnswer: 7\nTrivia Question: What’s the most expensive home in the world?\nAnswer:Buckingham Palace", "Trivia Question: What did the Crocodile swallow in Peter Pan?\nAnswer: An alarm clock\nTrivia Question: What’s the hardest rock?\nAnswer: A diamond\nTrivia Question: What is the national dish of Spain?\nAnswer: Paella\nTrivia Question: Which horoscope sign has a crab?\nAnswer: Cancer\nTrivia Question: What color is Absinthe?\nAnswer: Green\nTrivia Question: The Statue of Liberty was given to the US by which country?\nAnswer: France", "Trivia Question: Which US city is known as the City of Brotherly Love?\nAnswer:Philadelphia\nTrivia Question: What substance are nails made out of?\nAnswer: Keratin\nTrivia Question: How many children does Oprah Winfrey have?\nAnswer: Zero\nTrivia Question: Where is the Sea of Tranquility located?\nAnswer: The moon\nTrivia Question: What country has the world’s most ancient forest?\nAnswer: Australia\nTrivia Question: Which kind of bulbs were once exchanged as a form of currency?\nAnswer: Tulips", "Trivia Question: What color jersey is worn by the winners of each stage of the Tour De France?\nAnswer: Yellow\nTrivia Question: Which chess piece can only move diagonally?\nAnswer: A bishop\nTrivia Question: When did the Cold War end?\nAnswer: 1989\nTrivia Question: What is allspice alternatively known as?\nAnswer: Pimento\nTrivia Question: Who invented scissors?\nAnswer: Leonardo da Vinci\nTrivia Question: Which country was the Caesar salad invented in?\nAnswer: Mexico", "Trivia Question: On which ship did Charles Darwin make his famous expedition, which led to \nhis theory of evolution?\nAnswer: HMS Beagle\nTrivia Question: In which film did father and son actors Will and Jaden Smith first appear \ntogether?\nAnswer: The Pursuit of Happiness\nTrivia Question: Which NFL team holds the record for the most Super Bowl appearances?\nAnswer: New England Patriots\nTrivia Question: In which city is Jim Morrison buried?\nAnswer: Paris", "Trivia Question: Which actress keeps her Oscar in her bathroom so guests can hold it and \nmake speeches in the mirror shame-free?\nAnswer: Kate Winslet\nTrivia Question: In medieval England, what was used as currency, specifically for rental agree -\nments?\nAnswer: Eels\nTrivia Question: What famous horse won the Triple Crown in 1973?\nAnswer: Secretariat\nTrivia Question: What is the most common letter in the English alphabet?\nAnswer: E", "Trivia Question: Chimpanzees and gorillas have human-like fingerprints and so do what other \nnon-human animal?\nAnswer: Koalas\nTrivia Question: A tick bite can make you allergic to what food?\nAnswer: Red meat\nTrivia Question: What animal is constitutionally protected in Florida?\nAnswer: Pigs\nTrivia Question: What planets literally rain diamonds?\nAnswer: Saturn and Jupiter\nTrivia Question: Saudi Arabia imports camels from what country?\nAnswer: Australia", "Trivia Question: Who is is the youngest person ever to appear on a Billboard chart?\nAnswer: Blue Ivy Carter\nTrivia Question: What is the only state that borders just one other state?\nAnswer: Maine\nTrivia Question: What is the Twitter bird’s official?\nAnswer: Larry\nTrivia Question: What is a community of ants called?\nAnswer: A colony\nTrivia Question: Who was said to “float like a butterfly and sting like a bee”?\nAnswer: Muhammed Ali\nTrivia Question: Where did Heineken beer originate?\nAnswer: The Netherlands", "Trivia Question: “Cirque du Soleil”started in what country?\nAnswer: Canada\nTrivia Question: How many signs are there in the Zodiac?\nAnswer: 12\nTrivia Question: What are the two fruit juices in a cosmopolitan?\nAnswer: Cranberry and lime\nTrivia Question: What object is said to bring bad luck if it is broken?\nAnswer: A mirror\nTrivia Question: Which country did bagels originate from?\nAnswer: Poland\nTrivia Question: What is the name for the group of men who elect a Pope?\nAnswer: College of Cardinals", "Trivia Question: An Apgar score is given to what?\nAnswer: Health of newborns\nTrivia Question: The Candlestick, Lead Pipe, Knife, Revolver, Rope, and what else are the six \nweapons in a standard game of Clue?\nAnswer: Wrench\nTrivia Question: What city did Starbucks open its first store in 1971?\nAnswer: Seattle\nTrivia Question: What do you call filo pastry stuffed with chopped nuts and honey, or syrup?\nAnswer: Baklava\nTrivia Question: What is the Jewish New Y ear called?\nAnswer: Rosh Hashanah", "Trivia Question: What book starts with the line “Call me Ishmael. ”?\nAnswer: Moby Dick\nTrivia Question: What is the first element on the Periodic Table?\nAnswer: Hydrogen\nTrivia Question: What object did Ben Franklin attach to the end of a kite string to prove that \nlightning is electricity?\nAnswer: A metal key\nTrivia Question: What does a Scoville unit measure?\nAnswer: Spiciness\nTrivia Question: What US president put a Twinkie in the country’s millennium time capsule?\nAnswer: Bill Clinton", "Trivia Question: What is an ice hockey puck made from?\nAnswer: Rubber\nTrivia Question: Apple’s CEO Steve Jobs was known for wearing what color turtleneck?\nAnswer: Black\nTrivia Question: How many red stripes are there on the American flag?\nAnswer: Seven\nTrivia Question: What 3 word phrase is written on Martin Luther King’s gravestone?\nAnswer: Free At Last\nTrivia Question: What is Japanese sake made from?\nAnswer: Rice", "Trivia Question: What American beer has been long promoted as the “King of Beers”?\nAnswer: Budweiser\nTrivia Question: Which fashion designer was shot dead in the summer of 1997?\nAnswer: Gianni Versace\nTrivia Question: As what type of beans are chickpeas also known as?\nAnswer: Garbanzo\nTrivia Question: Galileo was the citizen of which country?\nAnswer: Italy\nTrivia Question: Which country is the largest producer of vanilla?\nAnswer: Madagascar", "Trivia Question: Who performs the character of Mark Zuckerberg in the movie “The Social \nNetwork”?\nAnswer: Jesse Eisenberg\nTrivia Question: What is the only fruit that has its seeds on the outside?\nAnswer: Strawberry\nTrivia Question: What is the only metal that is a liquid at normal atmospheric pressure and \ntemperature?\nAnswer: Mercury\nTrivia Question: Who was the only US President to resign?\nAnswer: Richard Nixon\nTrivia Question: In which city did Hitler commit suicide?\nAnswer: Berlin", "Trivia Question: In ancient Greece, throwing an apple at someone was a declaration of what?\nAnswer: Love\nTrivia Question: Who wrote songs for The Lion King?\nAnswer: Elton John\nTrivia Question: What U.S. newspaper is nicknamed “the Gray Lady”?\nAnswer: The New Y ork Times\nTrivia Question: What is the real first name of Marilyn Monroe?\nAnswer: Norma Jeane\nTrivia Question: What country has the most vending machines per capita?\nAnswer: Japan", "Trivia Question: What’s the most populous city in the United States?\nAnswer: New Y ork City\nTrivia Question: Which fruit floats because 25% of its volume is air?\nAnswer: Apple\nTrivia Question: What’s the brightest star in the sky?\nAnswer: Sirius\nTrivia Question: The Eiffel Tower was originally intended for what city?\nAnswer: Barcelona\nTrivia Question: In which of Britney’s video does she appear as a stewardess?\nAnswer: Toxic\nTrivia Question: Carrots are a good source of which vitamin?\nAnswer: Vitamin A", "Trivia Question: What is the name of the prehistoric town in which The Flinstones live?\nAnswer: Bedrock\nTrivia Question: What is the driest continent?\nAnswer: Antartica\nTrivia Question: Which US state has the longest cave system in the world?\nAnswer: Kentucky\nTrivia Question: What blood type qualifies as a universal donor?\nAnswer: O negative\nTrivia Question: What is the most abundant metal in the Earth’s crust?\nAnswer: Aluminium", "Trivia Question: What is the most abundant element in the universe?\nAnswer: Hydrogen\nTrivia Question: What was Babe Ruth’s first name?\nAnswer: George\nTrivia Question: Who was Sports Illustrated’s first female sportsperson of the year?\nAnswer: Billie Jean King\nTrivia Question: Robin Williams won a best supporting actor Oscar for what film?\nAnswer: Good Will Hunting\nTrivia Question: What was the first Disney animated film based on the life of a real person?\nAnswer: Pocahontas", "Trivia Question: What character did Michael J. Fox play in ‘Back to the Future’?\nAnswer: Marty McFly\nTrivia Question: What was the predecessor to the United Nations?\nAnswer: League of Nations\nTrivia Question: A flamboyance is a group of what animals?\nAnswer: Flamingos\nTrivia Question: What color is a polar bear’s skin?\nAnswer: Black\nTrivia Question: What is the largest lizard?\nAnswer: Komodo dragon\nTrivia Question: The male of what species testicles explode on mating and then dies?\nAnswer: Honeybee", "Trivia Question: Europe is separated from Africa by which sea?\nAnswer: Mediterranean Sea\nTrivia Question: Canberra is the capital city of which country?\nAnswer: Australia\nTrivia Question: New Y ork City comprises how many boroughs?\nAnswer: 5\nTrivia Question: Which nuts are used to make marzipan?\nAnswer: Almonds\nTrivia Question: Botany is the scientific study of what?\nAnswer: Plants\nTrivia Question: Tanks were used in battle for the first time in which conflict?\nAnswer: World War 1", "Trivia Question: Squab is a name given to the young of which bird?\nAnswer: Pigeon\nTrivia Question: Which female singer discovered a ‘Genie in a Bottle’ in 1999?\nAnswer: Christina Aguilera\nTrivia Question: Complete the title of a 1979 number one by Blondie – ‘Heart of… ’\nAnswer: Glass\nTrivia Question: Which Italian fascist leader was known as ‘Il Duce’?\nAnswer: Mussolini\nTrivia Question: If a male donkey is a jack, what is the female called?\nAnswer: Jenny", "Trivia Question: In what country did carving jack o’ lanterns originate?\nAnswer: Ireland\nTrivia Question: In what American state is it illegal to dress up like a priest or a nun?\nAnswer: Alabama\nTrivia Question: What is the largest planet in our solar system?\nAnswer: Jupiter\nTrivia Question: What has a gravitational pull so strong that even light cannot escape it?\nAnswer: Black Hole\nTrivia Question: Which 1998 Disney film was Lindsay Lohan’s film debut?\nAnswer: Parent Trap", "Trivia Question: What type of business did Annie have that failed in “Bridesmaids”?\nAnswer: Bakery\nTrivia Question: What were the two sides in World War II known as?\nAnswer: Allies and Axis\nTrivia Question: What number did Derek Jeter wear on his New Y ork Y ankees jersey?\nAnswer: 2\nTrivia Question: What vitamin does the sun’s ultraviolet rays help the skin produce?\nAnswer: Vitamin D\nTrivia Question: What is “jaggery, ” used in Indian cooking?\nAnswer: Sugar", "Trivia Question: What TV show won the most Emmys in 2018?\nAnswer:The Marvelous Mrs. Maisel\nTrivia Question: Nepal is located on which continent?\nAnswer: Asia\nTrivia Question: What does a seismologist study?\nAnswer: Earthquakes\nTrivia Question: Where did Barack Obama teach constitutional law?\nAnswer: University of Chicago\nTrivia Question: Which sea is located in Israel and Jordan?\nAnswer: Dead Sea\nTrivia Question: What are the bones in the fingers called?\nAnswer:Phalanges", "Trivia Question: What company makes the Butterfinger bar?\nAnswer: Nestle\nTrivia Question: Which character becomes Brienne’s squire in season 4 of “Game of Thrones”?\nAnswer: Podrick Payne\nTrivia Question: What particle in an atom has a positive charge?\nAnswer: Proton\nTrivia Question: What is the biggest artery in the human body?\nAnswer: Aorta\nTrivia Question: What is the name of Jordan’s capital city?\nAnswer: Amman\nTrivia Question: What is Harry Potter’s Patronus?\nAnswer: A stag", "Trivia Question: What candy was used to lure E.T. in the 1982 movie “E.T.: The Extra-Terrestri -\nal”?\nAnswer: Reese’s Pieces\nTrivia Question: The tuba is the largest member of which musical family?\nAnswer: Brass\nTrivia Question: Which is the main substance used to make a crayon?\nAnswer: Wax\nTrivia Question: The video game “Happy Feet” features what animals?\nAnswer: Penguins\nTrivia Question: What actress won her first Oscar for “Kramer vs. Kramer”?\nAnswer: Meryl Streep", "Trivia Question: What object of Dwight’s did Jim put in Jell-O on the TV show “The Office”?\nAnswer: Stapler\nTrivia Question: Who voices Morty in the series “Rick and Morty”?\nAnswer: Justin Rolland\nTrivia Question: “Y ou’re gonna need a bigger boat” originated in what movie?\nAnswer: Jaws\nTrivia Question: What does the “R” stand for on the rating of a movie?\nAnswer: Restricted\nTrivia Question: Who played Cher Horowitz in the movie “Clueless”?\nAnswer: Alicia Silverstone", "Trivia Question: Which artist painted, “Guernica”?\nAnswer: Pablo Picasso\nTrivia Question: What country produced the most strawberries in 2016?\nAnswer: China\nTrivia Question: The traditional Wimbledon colors are green and what?\nAnswer: Purple\nTrivia Question: On the television show “How I Met Y our Mother” , what is Lily’s occupation?\nAnswer: Kindergarten Teacher\nTrivia Question: Which art movement is Salvador Dali associated with?\nAnswer: Surrealism", "Trivia Question: Where did rap superstar Eminem grow up?\nAnswer: Detroit\nTrivia Question: In what city did Princess Diana suffer her fatal car crash?\nAnswer: Paris\nTrivia Question: What grows from an acorn?\nAnswer: Oak Tree\nTrivia Question: What prison film starring Tim Robbins was based on a story by Stephen King?\nAnswer: The Shawshank Redemption\nTrivia Question: Which U.S. state has “Garden State” as its nickname?\nAnswer: New Jersey", "Trivia Question: Which type of fruit juice did Dole sell first?\nAnswer: Pineapple\nTrivia Question: What is the main ingredient in falafel?\nAnswer: Chickpea\nTrivia Question: What currency is used in South Africa?\nAnswer: Rand\nTrivia Question: Port-au-Prince is the capital of which country?\nAnswer: Haiti\nTrivia Question: What major movie actor’s first role was in “ A Nightmare On Elm Street”?\nAnswer: Johnny Depp\nTrivia Question: What was Toyota’s first popular hybrid car called?\nAnswer: Prius", "Trivia Question: What did the first vending machine dispense?\nAnswer: Holy Water\nTrivia Question: Who created the animated series “Futurama”?\nAnswer: Matt Groening\nTrivia Question: What is the most populous city in Canada?\nAnswer: Toronto\nTrivia Question: Taylor Swift grew up on what type of farm?\nAnswer: Christmas Tree Farm\nTrivia Question: Which Doors song is about Jim Morrison’s relationship with Pamela Courson?\nAnswer: Queen Of The Highway", "Trivia Question: Which President of South Africa ordered Nelson Mandela’s release from pris -\non?\nAnswer: De Klerk\nTrivia Question: Which 2008 comedy had the tagline “Put this in your pipe and smoke it”?\nAnswer: Pineapple Express\nTrivia Question: Islamabad is the capital of which country?\nAnswer: Pakistan\nTrivia Question: American pioneer, John Chapman, was famous for planting which kind of \ntree?\nAnswer: Apple Trees\nTrivia Question: Where is the uvula located?\nAnswer: In The Throat", "Trivia Question: What gas makes soda bubbly?\nAnswer: Carbon Dioxide\nTrivia Question: Which country has a red flag with a star in the middle?\nAnswer: Morocco\nTrivia Question: Who preceded Fidel Castro as political leader of Cuba?\nAnswer: Fulgencio Batista\nTrivia Question: How many sides does the home plate in baseball have?\nAnswer: 5\nTrivia Question: What color dresses do Chinese women traditionally wear on their wedding \nday?\nAnswer: Red", "Trivia Question: Tom Cruise considered pursuing a career in what sport before being injured?\nAnswer: Wrestling\nTrivia Question: What country is bordered by Germany, the Czech Republic, Slovakia and the \nUkraine?\nAnswer: Poland\nTrivia Question: The Da Vinci Code opens with a murder in which famous museum?\nAnswer: Lourve\nTrivia Question: Which insect can indicate the air temperature?\nAnswer: Cricket\nTrivia Question: What candy ran the promotion for baseball’s one millionth run?\nAnswer: Tootsie Rolls", "Trivia Question: What country is the band “The Cranberries” from?\nAnswer: Ireland\nTrivia Question: Blueberries are native to which continent?\nAnswer: North America\nTrivia Question: A book by Barack Obama is titled “The Audacity of ” what?\nAnswer: Hope\nTrivia Question: What type of lens has a thin middle and makes objects appear smaller?\nAnswer: Concave\nTrivia Question: What is the Hawaiian name for yellow fin tuna?\nAnswer: Ahi", "Trivia Question: Rihanna banned fans from bringing what items to her U.K. concerts in 2008?\nAnswer: Umbrellas\nTrivia Question: Who created the alien rock superstar Ziggy Stardust?\nAnswer: David Bowie\nTrivia Question: Which young girl helped drive the English from French soil in the 15th centu -\nry?\nAnswer: Joan of Arc\nTrivia Question: What U.S. President coined the phrase “Good to the last drop, ” referring to \ncoffee?\nAnswer: Theodore Roosevelt", "Trivia Question: What is the biggest supermarket chain in the U.S.?\nAnswer: Kroger Co.\nTrivia Question: On every continent there is a city named what?\nAnswer: Rome\nTrivia Question: Which name are the Sandwich Islands better known as?\nAnswer: Hawaii"]