["I was just trying to check in and see how you're feeling. How you been man? He holding up man. Shut the fuck up. Bad. Alright. I didn't think it was that heavy of a question. Oh yeah? Yeah. How you been Christian? How am I? Yeah. Oh damn. Yeah. Damn that is heavy. Yeah. Well shit, it's been a minute since we've been out here. Yeah man, what's it been like four or five weeks? Five, six months. Stop. Is it October? Late October. No. It's like next week. Oh. Me. Oh I can believe that. What have I been doing ma", "ber? Late October. No. It's like next week. Oh. Me. Oh I can believe that. What have I been doing man? Oh no no. You got a dip. Huh? You heard me? Scram. Beat it. What just happened? Why do I have to leave? No no no no. What are you? Oh my god it's October already? 2020 to do list. I can't do all that in two months. Dunk, B6 foot, can boot your stain. I'm sorry. Can we talk about this stuff that you have checked off on this list? Yeah those are the only things I've done. Uh huh. So you've saved a life. Yeah", "ked off on this list? Yeah those are the only things I've done. Uh huh. So you've saved a life. Yeah man. I have. Who's life did you save? This guy, I was at this coffee shop and he came in without a mask on and he sneezed. And it hit me a little bit. And I just let him go. As opposed to what murdering him? Yeah. Uh huh. Okay. I'm going to go ahead and uncheck that one. Oh come on. Okay. There's a check mark next to fixed racism. You fixed racism? I did. Yeah. It was tough but. I did it. I didn't hear about", "next to fixed racism. You fixed racism? I did. Yeah. It was tough but. I did it. I didn't hear about that. Could you elaborate on how that went down? Yeah. Well I posted that black square. That's it. And then I, you know, I've ordered from black owned businesses on postmates. Okay. A couple of times. Got it. Uh no the black square and postmates from black businesses didn't fix racism. So I'm going to uncheck that one too. But like keep trying though for that one. Like where your head's at. Yeah I keep his p", "that one too. But like keep trying though for that one. Like where your head's at. Yeah I keep his post to square again man. I'm totally messed with my greatest. I'm going to get this done. Do shrooms in a park. Lakers win championship. You didn't do that. They won. Get fit. Why is this one circled? That's my number one priority right now. Your number one priority for the rest of 2020 is to get famous on TikTok. Yeah. Oh. What would you even post on there? All kinds of viral. Tiktok-y type stuff. What does ", "ok. Yeah. Oh. What would you even post on there? All kinds of viral. Tiktok-y type stuff. What does that mean? You know, it's just food with Mac cranberry juice stuff, lip syncing things. Other people say life hacks. And if all that fails I'll just become a dancing TikTok hot boy. Huh. Oh you think you're cute enough to be a dancing TikTok hot boy? You don't think I'm cute enough to become a dancing TikTok hot boy? You're not. I-yes I am. No, you're wrong. You have a mustache. Acute mustache? No, you look l", "t boy? You're not. I-yes I am. No, you're wrong. You have a mustache. Acute mustache? No, you look like the kind of uncle who would try to sell me ketamine at the breakfast table. Oh yeah? How about now? How about now? What are you done? What is this? Was that a baseball signal? Oh you think that's dancing? That's what dancing is now. That's not. Dancing. I disagree. I'm gonna take this out. This is a mother stuff I've been working on. Mmm what the fuck are you doing? Oh. I just- I don't think I'm your demo", "stuff I've been working on. Mmm what the fuck are you doing? Oh. I just- I don't think I'm your demo. What is this? I'm doing TikTok hot boy stuff. Jimmy you look like you're trying to seduce a bunch of high school sophomores. That's what TikTok is. Okay well I can't take you seriously. But that's just because I don't have my jaw implants yet. Jaw implants? Once these things start bulging bro I'll be on a fast track to the top. You think jaw implants are gonna make you TikTok fans. Jaw implants, maybe some ", "t track to the top. You think jaw implants are gonna make you TikTok fans. Jaw implants, maybe some dangly earrings. Kind of like those ones. We should collab. No. We could collab. I'm good. And I'm gonna go ahead and give you this list back. Seems like you got a lot of work to do. I know dude it's so stressful man. I mean I feel you that's why you know I had to push some of my goals to next year. Oh so you're saying push all my 2020 goals to 2021? No. No that sounds like a life hack. You know where that wo", "e saying push all my 2020 goals to 2021? No. No that sounds like a life hack. You know where that would crush it. TikTok. We should collab bro that's good. You're gonna make a TikTok out of that? One hundredth out. Got it. No need to tag me or anything. No I wasn't going to you. No way. Okay good. Okay well now that you just freed up a bunch of time what are you gonna do with the rest of your 2020? Really? Again with these heavy ass questions. You think it's really necessary for trucks to do that? I don't k", "ain with these heavy ass questions. You think it's really necessary for trucks to do that? I don't know. Like you gotta have a high pitch, be annoyed with your reverse. Mm-hmm. You think really necessary for trucks to do that? I don't know. Like you gotta have a high pitch, be annoyed with your reverse. Mm-hmm."]