["Trivia Questions Trivia Questions & Answers Trivia Question: What is the rarest M&M color? Answer: Brown Trivia Question: In a website browser address bar, what does “www” stand for? Answer: World Wide Web Trivia Question: In what year were the first Air Jordan sneakers released? Answer: 1984 trivia questions Trivia Question: In a game of bingo, which number is represented by the phrase “two little ducks”? Answer: 22 Trivia Question: According to Greek mythology who was the first woman on earth? Answer: Pan", "swer: 22 Trivia Question: According to Greek mythology who was the first woman on earth? Answer: Pandora Trivia Question: Samuel Tilden, Grover Cleveland, Al Gore and Hillary Clinton share what distinction among U.S. presidential candidates? Answer: They won the popular vote, but lost the electoral-college vote Trivia Question: Which African country was formerly known as Abyssinia? Answer: Ethiopia Trivia Question: Tennis star Serena Williams won which major tournament while pregnant with her first child? A", "stion: Tennis star Serena Williams won which major tournament while pregnant with her first child? Answer: The Australian Open Trivia Question: In which European city would you find Orly airport? Answer: Paris trivia questions Trivia Question: Which singer’s real name is Stefani Joanne Angelina Germanotta? Answer: Lady Gaga Trivia Question: The only known monotremes in the animal kingdom are the echidna and which other creature? Answer: The platypus Trivia Question: Kingston, Zuma, and Apollo are the sons o", "hich other creature? Answer: The platypus Trivia Question: Kingston, Zuma, and Apollo are the sons of which American female pop star? Answer: Gwen Stefani Trivia Question: Fissures, vents and plugs are all associated with which geological feature? Answer: Volcanos Trivia Question: Which author wrote the ‘Winnie-the-Pooh’ books? Answer: A. A. Milne Trivia Question: Which Dutch artist painted “Girl with a Pearl Earring”? Answer: Vermeer trivia questions Trivia Question: Where were the Declaration of Independe", " Earring”? Answer: Vermeer trivia questions Trivia Question: Where were the Declaration of Independence, the Constitution, and the Bill of Rights stored during World War II? Answer: Fort Knox Trivia Question: Which country consumes the most chocolate per capita? Answer: Switzerland Trivia Question: Which two U.S. states don’t observe Daylight Saving Time? Answer: Arizona and Hawaii Trivia Question: What is the loudest animal on Earth? Answer: The sperm whale Trivia Question: What was the first toy to be adv", "e loudest animal on Earth? Answer: The sperm whale Trivia Question: What was the first toy to be advertised on television? Answer: Mr. Potato Head trivia questions Trivia Question: What is the tiny piece at the end of a shoelace called? Answer: An aglet Trivia Question: In the United Kingdom, what is the day after Christmas known as? Answer: Boxing Day Trivia Question: Which of Shakespeare’s plays is the longest? Answer: Hamlet Trivia Question: Outside which New Y ork building was John Lennon killed? Answer", "est? Answer: Hamlet Trivia Question: Outside which New Y ork building was John Lennon killed? Answer: The Dakota Building Trivia Question: How many of Snow White’s seven dwarfs have names ending in the letter Y? Answer: Five: Dopey, Grumpy, Sneezy, Sleepy, Happy Trivia Question: I Know Why the Caged Bird Sings’ is the autobiography about the early years of what inspirational African-American writer and poet? Answer: Maya Angelou Trivia Question: What is the tallest breed of dog in the world? Answer: The Gre", "Answer: Maya Angelou Trivia Question: What is the tallest breed of dog in the world? Answer: The Great Dane trivia questions Trivia Question: What is the softest mineral in the world? Answer: Talc Trivia Question: Lateral Epicondylitis is a condition commonly known by what name? Answer: Tennis Elbow Trivia Question: Who was the first female Prime Minister of Great Britain? Answer: Margaret Thatcher Trivia Question: How many ribs are in a human body? Answer: Twenty-four Trivia Question: What is the world’s b", "stion: How many ribs are in a human body? Answer: Twenty-four Trivia Question: What is the world’s biggest island? Answer: Greenland Trivia Question: Which country is known as the Land of White Elephant? Answer: Thailand Trivia Question: What is the smallest ocean in the world? Answer: The Arctic Trivia Question: What color eyes do most humans have? Answer: Brown Trivia Question: In which city was Anne Frank’s hiding place? Answer: Amsterdam Trivia Question: What is the largest type of deer? Answer: The moo", "s hiding place? Answer: Amsterdam Trivia Question: What is the largest type of deer? Answer: The moose Trivia Question: Which Disney film features the song ‘When Y ou Wish Upon a Star’? Answer: Pinocchio Trivia Question: What is the lowest army rank of a US soldier? Answer: Private Trivia Question: Before the Beatles were formed, John Lennon, Paul McCartney and George Harrison were originally members of which group? Answer: The Quarrymen Trivia Question: What is the name of the Earth’s largest ocean? Answer", " group? Answer: The Quarrymen Trivia Question: What is the name of the Earth’s largest ocean? Answer: The Pacific Ocean Trivia Question: When Michael Jordan played for the Chicago Bulls, how many NBA Champi - onships did he win? Answer: Six Trivia Question: What country won the very first FIFA World Cup in 1930? Answer: Uruguay Trivia Question: In what year was the first ever Wimbledon Championship held? Answer: 1877 Trivia Question: What is often seen as the smallest unit of memory? Answer: kilobyte Trivia", "er: 1877 Trivia Question: What is often seen as the smallest unit of memory? Answer: kilobyte Trivia Question: Which planet is the hottest in the solar system? Answer: Venus Trivia Question: Which country produces the most coffee in the world? Answer: Brazil Trivia Question: What is the common name for dried plums? Answer: Prunes Trivia Question: What does BMW stand for (in English)? Answer: Bavarian Motor Works Trivia Question: Which two countries share the longest international border? Answer: Canada and ", "rks Trivia Question: Which two countries share the longest international border? Answer: Canada and the USA Trivia Question: What is the smallest country in the world? Answer: Vatican City Trivia Question: Which bone are babies born without? Answer: Knee cap Trivia Question: Which name is rapper Sean Combs better known by? Answer: P . Diddy Trivia Question: Which British girl group had a member by the name of Mel B? Answer: Spice Girls Trivia Question: How many hearts does an octopus have? Answer: Three Tri", " Mel B? Answer: Spice Girls Trivia Question: How many hearts does an octopus have? Answer: Three Trivia Question: How many eyes does a bee have? Answer: Five Trivia Question: What was the name of the rock band formed by Jimmy Page? Answer: Led Zeppelin Trivia Question: Who was the first woman to win a Nobel Prize (1903)? Answer: Marie Curie Trivia Question: Which mammal has no vocal cords? Answer: Giraffe Trivia Question: What type of music has been shown to help plants grow better and faster? Answer: Class", "via Question: What type of music has been shown to help plants grow better and faster? Answer: Classical Trivia Question: Power outages in the US are mostly caused by what? Answer: Squirrels Trivia Question: What celebrity has their dog cloned– twice? Answer: Barbara Streisand Trivia Question: What was the first state? Answer: Delaware Trivia Question: What is the painting ‘La Gioconda’ more usually known as? Answer: Mona Lisa Trivia Question: Ludwig Van Beethoven was born in 1770 in which city? Answer: Ber", " Answer: Mona Lisa Trivia Question: Ludwig Van Beethoven was born in 1770 in which city? Answer: Berlin Trivia Question: Water as a pH level of around? Answer: 7 Trivia Question: What’s the most expensive home in the world? Answer:Buckingham Palace Trivia Question: What did the Crocodile swallow in Peter Pan? Answer: An alarm clock Trivia Question: What’s the hardest rock? Answer: A diamond Trivia Question: What is the national dish of Spain? Answer: Paella Trivia Question: Which horoscope sign has a crab? ", "hat is the national dish of Spain? Answer: Paella Trivia Question: Which horoscope sign has a crab? Answer: Cancer Trivia Question: What color is Absinthe? Answer: Green Trivia Question: The Statue of Liberty was given to the US by which country? Answer: France Trivia Question: Which US city is known as the City of Brotherly Love? Answer:Philadelphia Trivia Question: What substance are nails made out of? Answer: Keratin Trivia Question: How many children does Oprah Winfrey have? Answer: Zero Trivia Question", "er: Keratin Trivia Question: How many children does Oprah Winfrey have? Answer: Zero Trivia Question: Where is the Sea of Tranquility located? Answer: The moon Trivia Question: What country has the world’s most ancient forest? Answer: Australia Trivia Question: Which kind of bulbs were once exchanged as a form of currency? Answer: Tulips Trivia Question: What color jersey is worn by the winners of each stage of the Tour De France? Answer: Yellow Trivia Question: Which chess piece can only move diagonally? A", "of the Tour De France? Answer: Yellow Trivia Question: Which chess piece can only move diagonally? Answer: A bishop Trivia Question: When did the Cold War end? Answer: 1989 Trivia Question: What is allspice alternatively known as? Answer: Pimento Trivia Question: Who invented scissors? Answer: Leonardo da Vinci Trivia Question: Which country was the Caesar salad invented in? Answer: Mexico Trivia Question: On which ship did Charles Darwin make his famous expedition, which led to his theory of evolution? Ans", " which ship did Charles Darwin make his famous expedition, which led to his theory of evolution? Answer: HMS Beagle Trivia Question: In which film did father and son actors Will and Jaden Smith first appear together? Answer: The Pursuit of Happiness Trivia Question: Which NFL team holds the record for the most Super Bowl appearances? Answer: New England Patriots Trivia Question: In which city is Jim Morrison buried? Answer: Paris Trivia Question: Which actress keeps her Oscar in her bathroom so guests can h", "buried? Answer: Paris Trivia Question: Which actress keeps her Oscar in her bathroom so guests can hold it and make speeches in the mirror shame-free? Answer: Kate Winslet Trivia Question: In medieval England, what was used as currency, specifically for rental agree - ments? Answer: Eels Trivia Question: What famous horse won the Triple Crown in 1973? Answer: Secretariat Trivia Question: What is the most common letter in the English alphabet? Answer: E Trivia Question: Chimpanzees and gorillas have human-li", "on letter in the English alphabet? Answer: E Trivia Question: Chimpanzees and gorillas have human-like fingerprints and so do what other non-human animal? Answer: Koalas Trivia Question: A tick bite can make you allergic to what food? Answer: Red meat Trivia Question: What animal is constitutionally protected in Florida? Answer: Pigs Trivia Question: What planets literally rain diamonds? Answer: Saturn and Jupiter Trivia Question: Saudi Arabia imports camels from what country? Answer: Australia Trivia Quest", "piter Trivia Question: Saudi Arabia imports camels from what country? Answer: Australia Trivia Question: Who is is the youngest person ever to appear on a Billboard chart? Answer: Blue Ivy Carter Trivia Question: What is the only state that borders just one other state? Answer: Maine Trivia Question: What is the Twitter bird’s official? Answer: Larry Trivia Question: What is a community of ants called? Answer: A colony Trivia Question: Who was said to “float like a butterfly and sting like a bee”? Answer: M", ": A colony Trivia Question: Who was said to “float like a butterfly and sting like a bee”? Answer: Muhammed Ali Trivia Question: Where did Heineken beer originate? Answer: The Netherlands Trivia Question: “Cirque du Soleil”started in what country? Answer: Canada Trivia Question: How many signs are there in the Zodiac? Answer: 12 Trivia Question: What are the two fruit juices in a cosmopolitan? Answer: Cranberry and lime Trivia Question: What object is said to bring bad luck if it is broken? Answer: A mirror", "ry and lime Trivia Question: What object is said to bring bad luck if it is broken? Answer: A mirror Trivia Question: Which country did bagels originate from? Answer: Poland Trivia Question: What is the name for the group of men who elect a Pope? Answer: College of Cardinals Trivia Question: An Apgar score is given to what? Answer: Health of newborns Trivia Question: The Candlestick, Lead Pipe, Knife, Revolver, Rope, and what else are the six weapons in a standard game of Clue? Answer: Wrench Trivia Questio", "r, Rope, and what else are the six weapons in a standard game of Clue? Answer: Wrench Trivia Question: What city did Starbucks open its first store in 1971? Answer: Seattle Trivia Question: What do you call filo pastry stuffed with chopped nuts and honey, or syrup? Answer: Baklava Trivia Question: What is the Jewish New Y ear called? Answer: Rosh Hashanah Trivia Question: What book starts with the line “Call me Ishmael. ”? Answer: Moby Dick Trivia Question: What is the first element on the Periodic Table? A", "me Ishmael. ”? Answer: Moby Dick Trivia Question: What is the first element on the Periodic Table? Answer: Hydrogen Trivia Question: What object did Ben Franklin attach to the end of a kite string to prove that lightning is electricity? Answer: A metal key Trivia Question: What does a Scoville unit measure? Answer: Spiciness Trivia Question: What US president put a Twinkie in the country’s millennium time capsule? Answer: Bill Clinton Trivia Question: What is an ice hockey puck made from? Answer: Rubber Tri", "sule? Answer: Bill Clinton Trivia Question: What is an ice hockey puck made from? Answer: Rubber Trivia Question: Apple’s CEO Steve Jobs was known for wearing what color turtleneck? Answer: Black Trivia Question: How many red stripes are there on the American flag? Answer: Seven Trivia Question: What 3 word phrase is written on Martin Luther King’s gravestone? Answer: Free At Last Trivia Question: What is Japanese sake made from? Answer: Rice Trivia Question: What American beer has been long promoted as the", "anese sake made from? Answer: Rice Trivia Question: What American beer has been long promoted as the “King of Beers”? Answer: Budweiser Trivia Question: Which fashion designer was shot dead in the summer of 1997? Answer: Gianni Versace Trivia Question: As what type of beans are chickpeas also known as? Answer: Garbanzo Trivia Question: Galileo was the citizen of which country? Answer: Italy Trivia Question: Which country is the largest producer of vanilla? Answer: Madagascar Trivia Question: Who performs th", "hich country is the largest producer of vanilla? Answer: Madagascar Trivia Question: Who performs the character of Mark Zuckerberg in the movie “The Social Network”? Answer: Jesse Eisenberg Trivia Question: What is the only fruit that has its seeds on the outside? Answer: Strawberry Trivia Question: What is the only metal that is a liquid at normal atmospheric pressure and temperature? Answer: Mercury Trivia Question: Who was the only US President to resign? Answer: Richard Nixon Trivia Question: In which c", "Question: Who was the only US President to resign? Answer: Richard Nixon Trivia Question: In which city did Hitler commit suicide? Answer: Berlin Trivia Question: In ancient Greece, throwing an apple at someone was a declaration of what? Answer: Love Trivia Question: Who wrote songs for The Lion King? Answer: Elton John Trivia Question: What U.S. newspaper is nicknamed “the Gray Lady”? Answer: The New Y ork Times Trivia Question: What is the real first name of Marilyn Monroe? Answer: Norma Jeane Trivia Ques", "imes Trivia Question: What is the real first name of Marilyn Monroe? Answer: Norma Jeane Trivia Question: What country has the most vending machines per capita? Answer: Japan Trivia Question: What’s the most populous city in the United States? Answer: New Y ork City Trivia Question: Which fruit floats because 25% of its volume is air? Answer: Apple Trivia Question: What’s the brightest star in the sky? Answer: Sirius Trivia Question: The Eiffel Tower was originally intended for what city? Answer: Barcelona ", ": Sirius Trivia Question: The Eiffel Tower was originally intended for what city? Answer: Barcelona Trivia Question: In which of Britney’s video does she appear as a stewardess? Answer: Toxic Trivia Question: Carrots are a good source of which vitamin? Answer: Vitamin A Trivia Question: What is the name of the prehistoric town in which The Flinstones live? Answer: Bedrock Trivia Question: What is the driest continent? Answer: Antartica Trivia Question: Which US state has the longest cave system in the world", "ontinent? Answer: Antartica Trivia Question: Which US state has the longest cave system in the world? Answer: Kentucky Trivia Question: What blood type qualifies as a universal donor? Answer: O negative Trivia Question: What is the most abundant metal in the Earth’s crust? Answer: Aluminium Trivia Question: What is the most abundant element in the universe? Answer: Hydrogen Trivia Question: What was Babe Ruth’s first name? Answer: George Trivia Question: Who was Sports Illustrated’s first female sportsperso", "’s first name? Answer: George Trivia Question: Who was Sports Illustrated’s first female sportsperson of the year? Answer: Billie Jean King Trivia Question: Robin Williams won a best supporting actor Oscar for what film? Answer: Good Will Hunting Trivia Question: What was the first Disney animated film based on the life of a real person? Answer: Pocahontas Trivia Question: What character did Michael J. Fox play in ‘Back to the Future’? Answer: Marty McFly Trivia Question: What was the predecessor to the Uni", "ay in ‘Back to the Future’? Answer: Marty McFly Trivia Question: What was the predecessor to the United Nations? Answer: League of Nations Trivia Question: A flamboyance is a group of what animals? Answer: Flamingos Trivia Question: What color is a polar bear’s skin? Answer: Black Trivia Question: What is the largest lizard? Answer: Komodo dragon Trivia Question: The male of what species testicles explode on mating and then dies? Answer: Honeybee Trivia Question: Europe is separated from Africa by which sea", "mating and then dies? Answer: Honeybee Trivia Question: Europe is separated from Africa by which sea? Answer: Mediterranean Sea Trivia Question: Canberra is the capital city of which country? Answer: Australia Trivia Question: New Y ork City comprises how many boroughs? Answer: 5 Trivia Question: Which nuts are used to make marzipan? Answer: Almonds Trivia Question: Botany is the scientific study of what? Answer: Plants Trivia Question: Tanks were used in battle for the first time in which conflict? Answer:", "wer: Plants Trivia Question: Tanks were used in battle for the first time in which conflict? Answer: World War 1 Trivia Question: Squab is a name given to the young of which bird? Answer: Pigeon Trivia Question: Which female singer discovered a ‘Genie in a Bottle’ in 1999? Answer: Christina Aguilera Trivia Question: Complete the title of a 1979 number one by Blondie – ‘Heart of… ’ Answer: Glass Trivia Question: Which Italian fascist leader was known as ‘Il Duce’? Answer: Mussolini Trivia Question: If a male", "n: Which Italian fascist leader was known as ‘Il Duce’? Answer: Mussolini Trivia Question: If a male donkey is a jack, what is the female called? Answer: Jenny Trivia Question: In what country did carving jack o’ lanterns originate? Answer: Ireland Trivia Question: In what American state is it illegal to dress up like a priest or a nun? Answer: Alabama Trivia Question: What is the largest planet in our solar system? Answer: Jupiter Trivia Question: What has a gravitational pull so strong that even light can", "system? Answer: Jupiter Trivia Question: What has a gravitational pull so strong that even light cannot escape it? Answer: Black Hole Trivia Question: Which 1998 Disney film was Lindsay Lohan’s film debut? Answer: Parent Trap Trivia Question: What type of business did Annie have that failed in “Bridesmaids”? Answer: Bakery Trivia Question: What were the two sides in World War II known as? Answer: Allies and Axis Trivia Question: What number did Derek Jeter wear on his New Y ork Y ankees jersey? Answer: 2 Tr", "xis Trivia Question: What number did Derek Jeter wear on his New Y ork Y ankees jersey? Answer: 2 Trivia Question: What vitamin does the sun’s ultraviolet rays help the skin produce? Answer: Vitamin D Trivia Question: What is “jaggery, ” used in Indian cooking? Answer: Sugar Trivia Question: What TV show won the most Emmys in 2018? Answer:The Marvelous Mrs. Maisel Trivia Question: Nepal is located on which continent? Answer: Asia Trivia Question: What does a seismologist study? Answer: Earthquakes Trivia Qu", "ntinent? Answer: Asia Trivia Question: What does a seismologist study? Answer: Earthquakes Trivia Question: Where did Barack Obama teach constitutional law? Answer: University of Chicago Trivia Question: Which sea is located in Israel and Jordan? Answer: Dead Sea Trivia Question: What are the bones in the fingers called? Answer:Phalanges Trivia Question: What company makes the Butterfinger bar? Answer: Nestle Trivia Question: Which character becomes Brienne’s squire in season 4 of “Game of Thrones”? Answer:", " Trivia Question: Which character becomes Brienne’s squire in season 4 of “Game of Thrones”? Answer: Podrick Payne Trivia Question: What particle in an atom has a positive charge? Answer: Proton Trivia Question: What is the biggest artery in the human body? Answer: Aorta Trivia Question: What is the name of Jordan’s capital city? Answer: Amman Trivia Question: What is Harry Potter’s Patronus? Answer: A stag Trivia Question: What candy was used to lure E.T. in the 1982 movie “E.T.: The Extra-Terrestri - al”?", "rivia Question: What candy was used to lure E.T. in the 1982 movie “E.T.: The Extra-Terrestri - al”? Answer: Reese’s Pieces Trivia Question: The tuba is the largest member of which musical family? Answer: Brass Trivia Question: Which is the main substance used to make a crayon? Answer: Wax Trivia Question: The video game “Happy Feet” features what animals? Answer: Penguins Trivia Question: What actress won her first Oscar for “Kramer vs. Kramer”? Answer: Meryl Streep Trivia Question: What object of Dwight’s", "r first Oscar for “Kramer vs. Kramer”? Answer: Meryl Streep Trivia Question: What object of Dwight’s did Jim put in Jell-O on the TV show “The Office”? Answer: Stapler Trivia Question: Who voices Morty in the series “Rick and Morty”? Answer: Justin Rolland Trivia Question: “Y ou’re gonna need a bigger boat” originated in what movie? Answer: Jaws Trivia Question: What does the “R” stand for on the rating of a movie? Answer: Restricted Trivia Question: Who played Cher Horowitz in the movie “Clueless”? Answer:", "movie? Answer: Restricted Trivia Question: Who played Cher Horowitz in the movie “Clueless”? Answer: Alicia Silverstone Trivia Question: Which artist painted, “Guernica”? Answer: Pablo Picasso Trivia Question: What country produced the most strawberries in 2016? Answer: China Trivia Question: The traditional Wimbledon colors are green and what? Answer: Purple Trivia Question: On the television show “How I Met Y our Mother” , what is Lily’s occupation? Answer: Kindergarten Teacher Trivia Question: Which art ", " Y our Mother” , what is Lily’s occupation? Answer: Kindergarten Teacher Trivia Question: Which art movement is Salvador Dali associated with? Answer: Surrealism Trivia Question: Where did rap superstar Eminem grow up? Answer: Detroit Trivia Question: In what city did Princess Diana suffer her fatal car crash? Answer: Paris Trivia Question: What grows from an acorn? Answer: Oak Tree Trivia Question: What prison film starring Tim Robbins was based on a story by Stephen King? Answer: The Shawshank Redemption ", "on film starring Tim Robbins was based on a story by Stephen King? Answer: The Shawshank Redemption Trivia Question: Which U.S. state has “Garden State” as its nickname? Answer: New Jersey Trivia Question: Which type of fruit juice did Dole sell first? Answer: Pineapple Trivia Question: What is the main ingredient in falafel? Answer: Chickpea Trivia Question: What currency is used in South Africa? Answer: Rand Trivia Question: Port-au-Prince is the capital of which country? Answer: Haiti Trivia Question: Wh", "d Trivia Question: Port-au-Prince is the capital of which country? Answer: Haiti Trivia Question: What major movie actor’s first role was in “ A Nightmare On Elm Street”? Answer: Johnny Depp Trivia Question: What was Toyota’s first popular hybrid car called? Answer: Prius Trivia Question: What did the first vending machine dispense? Answer: Holy Water Trivia Question: Who created the animated series “Futurama”? Answer: Matt Groening Trivia Question: What is the most populous city in Canada? Answer: Toronto ", "”? Answer: Matt Groening Trivia Question: What is the most populous city in Canada? Answer: Toronto Trivia Question: Taylor Swift grew up on what type of farm? Answer: Christmas Tree Farm Trivia Question: Which Doors song is about Jim Morrison’s relationship with Pamela Courson? Answer: Queen Of The Highway Trivia Question: Which President of South Africa ordered Nelson Mandela’s release from pris - on? Answer: De Klerk Trivia Question: Which 2008 comedy had the tagline “Put this in your pipe and smoke it”?", "r: De Klerk Trivia Question: Which 2008 comedy had the tagline “Put this in your pipe and smoke it”? Answer: Pineapple Express Trivia Question: Islamabad is the capital of which country? Answer: Pakistan Trivia Question: American pioneer, John Chapman, was famous for planting which kind of tree? Answer: Apple Trees Trivia Question: Where is the uvula located? Answer: In The Throat Trivia Question: What gas makes soda bubbly? Answer: Carbon Dioxide Trivia Question: Which country has a red flag with a star in", "kes soda bubbly? Answer: Carbon Dioxide Trivia Question: Which country has a red flag with a star in the middle? Answer: Morocco Trivia Question: Who preceded Fidel Castro as political leader of Cuba? Answer: Fulgencio Batista Trivia Question: How many sides does the home plate in baseball have? Answer: 5 Trivia Question: What color dresses do Chinese women traditionally wear on their wedding day? Answer: Red Trivia Question: Tom Cruise considered pursuing a career in what sport before being injured? Answer", " Trivia Question: Tom Cruise considered pursuing a career in what sport before being injured? Answer: Wrestling Trivia Question: What country is bordered by Germany, the Czech Republic, Slovakia and the Ukraine? Answer: Poland Trivia Question: The Da Vinci Code opens with a murder in which famous museum? Answer: Lourve Trivia Question: Which insect can indicate the air temperature? Answer: Cricket Trivia Question: What candy ran the promotion for baseball’s one millionth run? Answer: Tootsie Rolls Trivia Qu", "tion: What candy ran the promotion for baseball’s one millionth run? Answer: Tootsie Rolls Trivia Question: What country is the band “The Cranberries” from? Answer: Ireland Trivia Question: Blueberries are native to which continent? Answer: North America Trivia Question: A book by Barack Obama is titled “The Audacity of ” what? Answer: Hope Trivia Question: What type of lens has a thin middle and makes objects appear smaller? Answer: Concave Trivia Question: What is the Hawaiian name for yellow fin tuna? An", "s appear smaller? Answer: Concave Trivia Question: What is the Hawaiian name for yellow fin tuna? Answer: Ahi Trivia Question: Rihanna banned fans from bringing what items to her U.K. concerts in 2008? Answer: Umbrellas Trivia Question: Who created the alien rock superstar Ziggy Stardust? Answer: David Bowie Trivia Question: Which young girl helped drive the English from French soil in the 15th centu - ry? Answer: Joan of Arc Trivia Question: What U.S. President coined the phrase “Good to the last drop, ” r", "swer: Joan of Arc Trivia Question: What U.S. President coined the phrase “Good to the last drop, ” referring to coffee? Answer: Theodore Roosevelt Trivia Question: What is the biggest supermarket chain in the U.S.? Answer: Kroger Co. Trivia Question: On every continent there is a city named what? Answer: Rome Trivia Question: Which name are the Sandwich Islands better known as? Answer: Hawaii"]